Contents of the .debug_info section:

  Compilation Unit @ offset 0:
   Length:        0x976 (32-bit)
   Version:       5
   Unit Type:     DW_UT_compile (1)
   Abbrev Offset: 0
   Pointer Size:  4
 <0><c>: Abbrev Number: 20 (DW_TAG_compile_unit)
    <d>   DW_AT_producer    : (indirect string, offset: 0x35fed): GNU C11 12.3.1 20230626 -mcpu=cortex-m4 -mfpu=fpv4-sp-d16 -mfloat-abi=hard -mthumb -march=armv7e-m+fp -g3 -O0 -std=gnu11 -ffunction-sections -fdata-sections -fstack-usage -fcyclomatic-complexity
    <11>   DW_AT_language    : 29	(C11)
    <12>   DW_AT_name        : (indirect string, offset: 0x9136f): ../Core/Src/freertos.c
    <16>   DW_AT_comp_dir    : (indirect string, offset: 0x602c5): C:/Users/yahmad/Downloads/vpersonal/bajaDAQ/can/Debug
    <1a>   DW_AT_ranges      : 0xc
    <1e>   DW_AT_low_pc      : 0
    <22>   DW_AT_stmt_list   : 0
    <26>   DW_AT_macros      : 0
 <1><2a>: Abbrev Number: 21 (DW_TAG_base_type)
    <2b>   DW_AT_byte_size   : 4
    <2c>   DW_AT_encoding    : 5	(signed)
    <2d>   DW_AT_name        : int
 <1><31>: Abbrev Number: 6 (DW_TAG_base_type)
    <32>   DW_AT_byte_size   : 4
    <33>   DW_AT_encoding    : 7	(unsigned)
    <34>   DW_AT_name        : (indirect string, offset: 0xbbd7): unsigned int
 <1><38>: Abbrev Number: 6 (DW_TAG_base_type)
    <39>   DW_AT_byte_size   : 8
    <3a>   DW_AT_encoding    : 5	(signed)
    <3b>   DW_AT_name        : (indirect string, offset: 0x42d90): long long int
 <1><3f>: Abbrev Number: 6 (DW_TAG_base_type)

 <1><4d>: Abbrev Number: 4 (DW_TAG_typedef)
    <4e>   DW_AT_name        : (indirect string, offset: 0x2a433): __uint8_t
    <52>   DW_AT_decl_file   : 2
    <53>   DW_AT_decl_line   : 43
    <54>   DW_AT_decl_column : 24
    <55>   DW_AT_type        : <0x59>
 <1><59>: Abbrev Number: 6 (DW_TAG_base_type)
    <5a>   DW_AT_byte_size   : 1
    <5b>   DW_AT_encoding    : 8	(unsigned char)
    <5c>   DW_AT_name        : (indirect string, offset: 0x1e203): unsigned char
 <1><60>: Abbrev Number: 6 (DW_TAG_base_type)
    <61>   DW_AT_byte_size   : 2
    <62>   DW_AT_encoding    : 5	(signed)
    <63>   DW_AT_name        : (indirect string, offset: 0x6d523): short int
 <1><67>: Abbrev Number: 4 (DW_TAG_typedef)
    <68>   DW_AT_name        : (indirect string, offset: 0x778ee): __uint16_t
    <6c>   DW_AT_decl_file   : 2
    <6d>   DW_AT_decl_line   : 57
    <6e>   DW_AT_decl_column : 25
    <6f>   DW_AT_type        : <0x73>
 <1><73>: Abbrev Number: 6 (DW_TAG_base_type)
    <74>   DW_AT_byte_size   : 2
    <75>   DW_AT_encoding    : 7	(unsigned)
    <76>   DW_AT_name        : (indirect string, offset: 0x8cdd1): short unsigned int
 <1><7a>: Abbrev Number: 6 (DW_TAG_base_type)
    <7b>   DW_AT_byte_size   : 4
    <7c>   DW_AT_encoding    : 5	(signed)
    <7d>   DW_AT_name        : (indirect string, offset: 0xc13b): long int
 <1><81>: Abbrev Number: 4 (DW_TAG_typedef)
    <82>   DW_AT_name        : (indirect string, offset: 0x5d4be): __uint32_t
    <86>   DW_AT_decl_file   : 2
    <87>   DW_AT_decl_line   : 79
    <88>   DW_AT_decl_column : 25
    <89>   DW_AT_type        : <0x8d>
 <1><8d>: Abbrev Number: 6 (DW_TAG_base_type)
    <8e>   DW_AT_byte_size   : 4
    <8f>   DW_AT_encoding    : 7	(unsigned)
    <90>   DW_AT_name        : (indirect string, offset: 0x2d0f6): long unsigned int
 <1><94>: Abbrev Number: 6 (DW_TAG_base_type)
    <95>   DW_AT_byte_size   : 8
    <96>   DW_AT_encoding    : 7	(unsigned)
    <97>   DW_AT_name        : (indirect string, offset: 0x1eb13): long long unsigned int
 <1><9b>: Abbrev Number: 4 (DW_TAG_typedef)
    <9c>   DW_AT_name        : (indirect string, offset: 0x2a435): uint8_t
    <a0>   DW_AT_decl_file   : 3
    <a1>   DW_AT_decl_line   : 24
    <a2>   DW_AT_decl_column : 19
    <a3>   DW_AT_type        : <0x4d>
 <1><a7>: Abbrev Number: 4 (DW_TAG_typedef)
    <a8>   DW_AT_name        : (indirect string, offset: 0x6acfb): uint16_t
    <ac>   DW_AT_decl_file   : 3
    <ad>   DW_AT_decl_line   : 36
    <ae>   DW_AT_decl_column : 20
    <af>   DW_AT_type        : <0x67>
 <1><b3>: Abbrev Number: 4 (DW_TAG_typedef)
    <b4>   DW_AT_name        : (indirect string, offset: 0x6a5b8): uint32_t
    <b8>   DW_AT_decl_file   : 3
    <b9>   DW_AT_decl_line   : 48
    <ba>   DW_AT_decl_column : 20
    <bb>   DW_AT_type        : <0x81>
 <1><bf>: Abbrev Number: 22 (DW_TAG_pointer_type)
    <c0>   DW_AT_byte_size   : 4
 <1><c1>: Abbrev Number: 4 (DW_TAG_typedef)
    <c2>   DW_AT_name        : (indirect string, offset: 0x6b08b): StackType_t
    <c6>   DW_AT_decl_file   : 4
    <c7>   DW_AT_decl_line   : 55
    <c8>   DW_AT_decl_column : 24
    <c9>   DW_AT_type        : <0xb3>
 <1><cd>: Abbrev Number: 4 (DW_TAG_typedef)
    <ce>   DW_AT_name        : (indirect string, offset: 0x87765): UBaseType_t
    <d2>   DW_AT_decl_file   : 4
    <d3>   DW_AT_decl_line   : 57
    <d4>   DW_AT_decl_column : 23
    <d5>   DW_AT_type        : <0x8d>
 <1><d9>: Abbrev Number: 4 (DW_TAG_typedef)
    <da>   DW_AT_name        : (indirect string, offset: 0x51351): TickType_t
    <de>   DW_AT_decl_file   : 4
    <df>   DW_AT_decl_line   : 63
    <e0>   DW_AT_decl_column : 19
    <e1>   DW_AT_type        : <0xb3>
 <1><e5>: Abbrev Number: 12 (DW_TAG_typedef)
    <e6>   DW_AT_name        : (indirect string, offset: 0x6be3b): wint_t
    <ea>   DW_AT_decl_file   : 5
    <eb>   DW_AT_decl_line   : 359
    <ed>   DW_AT_decl_column : 23
    <ee>   DW_AT_type        : <0x31>
 <1><f2>: Abbrev Number: 4 (DW_TAG_typedef)
    <f3>   DW_AT_name        : (indirect string, offset: 0x9a3e9): _off_t
    <f7>   DW_AT_decl_file   : 6
    <f8>   DW_AT_decl_line   : 46
    <f9>   DW_AT_decl_column : 14
    <fa>   DW_AT_type        : <0x7a>
 <1><fe>: Abbrev Number: 4 (DW_TAG_typedef)
    <ff>   DW_AT_name        : (indirect string, offset: 0x20d0c): _fpos_t
    <103>   DW_AT_decl_file   : 6
    <104>   DW_AT_decl_line   : 116
    <105>   DW_AT_decl_column : 14
    <106>   DW_AT_type        : <0x7a>
 <1><10a>: Abbrev Number: 23 (DW_TAG_union_type)
    <10b>   DW_AT_byte_size   : 4
    <10c>   DW_AT_decl_file   : 6
    <10d>   DW_AT_decl_line   : 165
    <10e>   DW_AT_decl_column : 3
    <10f>   DW_AT_sibling     : <0x12a>
 <2><113>: Abbrev Number: 16 (DW_TAG_member)
    <114>   DW_AT_name        : (indirect string, offset: 0x70869): __wch
    <118>   DW_AT_decl_file   : 6
    <118>   DW_AT_decl_line   : 167
    <119>   DW_AT_decl_column : 12
    <11a>   DW_AT_type        : <0xe5>
 <2><11e>: Abbrev Number: 16 (DW_TAG_member)
    <11f>   DW_AT_name        : (indirect string, offset: 0x4bcb2): __wchb
    <123>   DW_AT_decl_file   : 6
    <123>   DW_AT_decl_line   : 168
    <124>   DW_AT_decl_column : 19
    <125>   DW_AT_type        : <0x12a>
 <2><129>: Abbrev Number: 0
 <1><12a>: Abbrev Number: 7 (DW_TAG_array_type)
    <12b>   DW_AT_type        : <0x59>
    <12f>   DW_AT_sibling     : <0x13a>
 <2><133>: Abbrev Number: 8 (DW_TAG_subrange_type)
    <134>   DW_AT_type        : <0x31>
    <138>   DW_AT_upper_bound : 3
 <2><139>: Abbrev Number: 0
 <1><13a>: Abbrev Number: 24 (DW_TAG_structure_type)
    <13b>   DW_AT_byte_size   : 8
    <13c>   DW_AT_decl_file   : 6
    <13d>   DW_AT_decl_line   : 162
    <13e>   DW_AT_decl_column : 9
    <13f>   DW_AT_sibling     : <0x15e>
 <2><143>: Abbrev Number: 2 (DW_TAG_member)
    <144>   DW_AT_name        : (indirect string, offset: 0x29014): __count
    <148>   DW_AT_decl_file   : 6
    <149>   DW_AT_decl_line   : 164
    <14a>   DW_AT_decl_column : 7
    <14b>   DW_AT_type        : <0x2a>
    <14f>   DW_AT_data_member_location: 0
 <2><150>: Abbrev Number: 2 (DW_TAG_member)
    <151>   DW_AT_name        : (indirect string, offset: 0x5474e): __value
    <155>   DW_AT_decl_file   : 6
    <156>   DW_AT_decl_line   : 169
    <157>   DW_AT_decl_column : 5
    <158>   DW_AT_type        : <0x10a>
    <15c>   DW_AT_data_member_location: 4
 <2><15d>: Abbrev Number: 0
 <1><15e>: Abbrev Number: 4 (DW_TAG_typedef)
    <15f>   DW_AT_name        : (indirect string, offset: 0x4cf49): _mbstate_t
    <163>   DW_AT_decl_file   : 6
    <164>   DW_AT_decl_line   : 170
    <165>   DW_AT_decl_column : 3
    <166>   DW_AT_type        : <0x13a>
 <1><16a>: Abbrev Number: 4 (DW_TAG_typedef)
    <16b>   DW_AT_name        : (indirect string, offset: 0x4f81a): __ULong
    <16f>   DW_AT_decl_file   : 7
    <170>   DW_AT_decl_line   : 22
    <171>   DW_AT_decl_column : 25
    <172>   DW_AT_type        : <0x8d>
 <1><176>: Abbrev Number: 4 (DW_TAG_typedef)
    <177>   DW_AT_name        : (indirect string, offset: 0x50f22): _LOCK_T
    <17b>   DW_AT_decl_file   : 8
    <17c>   DW_AT_decl_line   : 34
    <17d>   DW_AT_decl_column : 25
    <17e>   DW_AT_type        : <0x182>
 <1><182>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <183>   DW_AT_byte_size   : 4
    <183>   DW_AT_type        : <0x187>
 <1><187>: Abbrev Number: 15 (DW_TAG_structure_type)
    <188>   DW_AT_name        : (indirect string, offset: 0x2d328): __lock
    <18c>   DW_AT_declaration : 1
 <1><18c>: Abbrev Number: 4 (DW_TAG_typedef)
    <18d>   DW_AT_name        : (indirect string, offset: 0x48a35): _flock_t
    <191>   DW_AT_decl_file   : 7
    <192>   DW_AT_decl_line   : 35
    <193>   DW_AT_decl_column : 27
    <194>   DW_AT_type        : <0x176>
 <1><198>: Abbrev Number: 13 (DW_TAG_structure_type)
    <199>   DW_AT_name        : (indirect string, offset: 0x32e39): _Bigint
    <19d>   DW_AT_byte_size   : 24
    <19e>   DW_AT_decl_file   : 7
    <19e>   DW_AT_decl_line   : 52
    <19f>   DW_AT_decl_column : 8
    <19f>   DW_AT_sibling     : <0x1ee>
 <2><1a3>: Abbrev Number: 2 (DW_TAG_member)
    <1a4>   DW_AT_name        : (indirect string, offset: 0x57757): _next
    <1a8>   DW_AT_decl_file   : 7
    <1a9>   DW_AT_decl_line   : 54
    <1aa>   DW_AT_decl_column : 19
    <1ab>   DW_AT_type        : <0x1ee>
    <1af>   DW_AT_data_member_location: 0
 <2><1b0>: Abbrev Number: 9 (DW_TAG_member)
    <1b1>   DW_AT_name        : _k
    <1b4>   DW_AT_decl_file   : 7
    <1b4>   DW_AT_decl_line   : 55
    <1b5>   DW_AT_decl_column : 7
    <1b6>   DW_AT_type        : <0x2a>
    <1ba>   DW_AT_data_member_location: 4
 <2><1bb>: Abbrev Number: 2 (DW_TAG_member)
    <1bc>   DW_AT_name        : (indirect string, offset: 0x68d58): _maxwds
    <1c0>   DW_AT_decl_file   : 7
    <1c1>   DW_AT_decl_line   : 55
    <1c2>   DW_AT_decl_column : 11
    <1c3>   DW_AT_type        : <0x2a>
    <1c7>   DW_AT_data_member_location: 8
 <2><1c8>: Abbrev Number: 2 (DW_TAG_member)
    <1c9>   DW_AT_name        : (indirect string, offset: 0x4e2a6): _sign
    <1cd>   DW_AT_decl_file   : 7
    <1ce>   DW_AT_decl_line   : 55
    <1cf>   DW_AT_decl_column : 20
    <1d0>   DW_AT_type        : <0x2a>
    <1d4>   DW_AT_data_member_location: 12
 <2><1d5>: Abbrev Number: 2 (DW_TAG_member)
    <1d6>   DW_AT_name        : (indirect string, offset: 0x4deb9): _wds
    <1da>   DW_AT_decl_file   : 7
    <1db>   DW_AT_decl_line   : 55
    <1dc>   DW_AT_decl_column : 27
    <1dd>   DW_AT_type        : <0x2a>
    <1e1>   DW_AT_data_member_location: 16
 <2><1e2>: Abbrev Number: 9 (DW_TAG_member)
    <1e3>   DW_AT_name        : _x
    <1e6>   DW_AT_decl_file   : 7
    <1e6>   DW_AT_decl_line   : 56
    <1e7>   DW_AT_decl_column : 11
    <1e8>   DW_AT_type        : <0x1f3>
    <1ec>   DW_AT_data_member_location: 20
 <2><1ed>: Abbrev Number: 0
 <1><1ee>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <1ef>   DW_AT_byte_size   : 4
    <1ef>   DW_AT_type        : <0x198>
 <1><1f3>: Abbrev Number: 7 (DW_TAG_array_type)
    <1f4>   DW_AT_type        : <0x16a>
    <1f8>   DW_AT_sibling     : <0x203>
 <2><1fc>: Abbrev Number: 8 (DW_TAG_subrange_type)
    <1fd>   DW_AT_type        : <0x31>
    <201>   DW_AT_upper_bound : 0
 <2><202>: Abbrev Number: 0
 <1><203>: Abbrev Number: 13 (DW_TAG_structure_type)
    <204>   DW_AT_name        : (indirect string, offset: 0x27ecc): __tm
    <208>   DW_AT_byte_size   : 36
    <209>   DW_AT_decl_file   : 7
    <209>   DW_AT_decl_line   : 60
    <20a>   DW_AT_decl_column : 8
    <20a>   DW_AT_sibling     : <0x284>
 <2><20e>: Abbrev Number: 2 (DW_TAG_member)
    <20f>   DW_AT_name        : (indirect string, offset: 0x77e12): __tm_sec
    <213>   DW_AT_decl_file   : 7
    <214>   DW_AT_decl_line   : 62
    <215>   DW_AT_decl_column : 9
    <216>   DW_AT_type        : <0x2a>
    <21a>   DW_AT_data_member_location: 0
 <2><21b>: Abbrev Number: 2 (DW_TAG_member)
    <21c>   DW_AT_name        : (indirect string, offset: 0x9b0): __tm_min
    <220>   DW_AT_decl_file   : 7
    <221>   DW_AT_decl_line   : 63
    <222>   DW_AT_decl_column : 9
    <223>   DW_AT_type        : <0x2a>
    <227>   DW_AT_data_member_location: 4
 <2><228>: Abbrev Number: 2 (DW_TAG_member)
    <229>   DW_AT_name        : (indirect string, offset: 0x1f880): __tm_hour
    <22d>   DW_AT_decl_file   : 7
    <22e>   DW_AT_decl_line   : 64
    <22f>   DW_AT_decl_column : 9
    <230>   DW_AT_type        : <0x2a>
    <234>   DW_AT_data_member_location: 8
 <2><235>: Abbrev Number: 2 (DW_TAG_member)
    <236>   DW_AT_name        : (indirect string, offset: 0x56259): __tm_mday
    <23a>   DW_AT_decl_file   : 7
    <23b>   DW_AT_decl_line   : 65
    <23c>   DW_AT_decl_column : 9
    <23d>   DW_AT_type        : <0x2a>
    <241>   DW_AT_data_member_location: 12
 <2><242>: Abbrev Number: 2 (DW_TAG_member)
    <243>   DW_AT_name        : (indirect string, offset: 0x2625): __tm_mon
    <247>   DW_AT_decl_file   : 7
    <248>   DW_AT_decl_line   : 66
    <249>   DW_AT_decl_column : 9
    <24a>   DW_AT_type        : <0x2a>
    <24e>   DW_AT_data_member_location: 16
 <2><24f>: Abbrev Number: 2 (DW_TAG_member)
    <250>   DW_AT_name        : (indirect string, offset: 0x88ef5): __tm_year
    <254>   DW_AT_decl_file   : 7
    <255>   DW_AT_decl_line   : 67
    <256>   DW_AT_decl_column : 9
    <257>   DW_AT_type        : <0x2a>
    <25b>   DW_AT_data_member_location: 20
 <2><25c>: Abbrev Number: 2 (DW_TAG_member)
    <25d>   DW_AT_name        : (indirect string, offset: 0x3d8d9): __tm_wday
    <261>   DW_AT_decl_file   : 7
    <262>   DW_AT_decl_line   : 68
    <263>   DW_AT_decl_column : 9
    <264>   DW_AT_type        : <0x2a>
    <268>   DW_AT_data_member_location: 24
 <2><269>: Abbrev Number: 2 (DW_TAG_member)
    <26a>   DW_AT_name        : (indirect string, offset: 0x740a7): __tm_yday
    <26e>   DW_AT_decl_file   : 7
    <26f>   DW_AT_decl_line   : 69
    <270>   DW_AT_decl_column : 9
    <271>   DW_AT_type        : <0x2a>
    <275>   DW_AT_data_member_location: 28
 <2><276>: Abbrev Number: 2 (DW_TAG_member)
    <277>   DW_AT_name        : (indirect string, offset: 0x841bd): __tm_isdst
    <27b>   DW_AT_decl_file   : 7
    <27c>   DW_AT_decl_line   : 70
    <27d>   DW_AT_decl_column : 9
    <27e>   DW_AT_type        : <0x2a>
    <282>   DW_AT_data_member_location: 32
 <2><283>: Abbrev Number: 0
 <1><284>: Abbrev Number: 13 (DW_TAG_structure_type)
    <285>   DW_AT_name        : (indirect string, offset: 0x61a8a): __sbuf
    <289>   DW_AT_byte_size   : 8
    <28a>   DW_AT_decl_file   : 7
    <28a>   DW_AT_decl_line   : 115
    <28b>   DW_AT_decl_column : 8
    <28b>   DW_AT_sibling     : <0x2aa>
 <2><28f>: Abbrev Number: 2 (DW_TAG_member)
    <290>   DW_AT_name        : (indirect string, offset: 0x920f7): _base
    <294>   DW_AT_decl_file   : 7
    <295>   DW_AT_decl_line   : 116
    <296>   DW_AT_decl_column : 17
    <297>   DW_AT_type        : <0x2aa>
    <29b>   DW_AT_data_member_location: 0
 <2><29c>: Abbrev Number: 2 (DW_TAG_member)
    <29d>   DW_AT_name        : (indirect string, offset: 0x99c07): _size
    <2a1>   DW_AT_decl_file   : 7
    <2a2>   DW_AT_decl_line   : 117
    <2a3>   DW_AT_decl_column : 6
    <2a4>   DW_AT_type        : <0x2a>
    <2a8>   DW_AT_data_member_location: 4
 <2><2a9>: Abbrev Number: 0
 <1><2aa>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <2ab>   DW_AT_byte_size   : 4
    <2ab>   DW_AT_type        : <0x59>
 <1><2af>: Abbrev Number: 13 (DW_TAG_structure_type)
    <2b0>   DW_AT_name        : (indirect string, offset: 0x705be): __sFILE
    <2b4>   DW_AT_byte_size   : 104
    <2b5>   DW_AT_decl_file   : 7
    <2b5>   DW_AT_decl_line   : 152
    <2b6>   DW_AT_decl_column : 8
    <2b6>   DW_AT_sibling     : <0x3e8>
 <2><2ba>: Abbrev Number: 9 (DW_TAG_member)
    <2bb>   DW_AT_name        : _p
    <2be>   DW_AT_decl_file   : 7
    <2be>   DW_AT_decl_line   : 153
    <2bf>   DW_AT_decl_column : 18
    <2c0>   DW_AT_type        : <0x2aa>
    <2c4>   DW_AT_data_member_location: 0
 <2><2c5>: Abbrev Number: 9 (DW_TAG_member)
    <2c6>   DW_AT_name        : _r
    <2c9>   DW_AT_decl_file   : 7
    <2c9>   DW_AT_decl_line   : 154
    <2ca>   DW_AT_decl_column : 7
    <2cb>   DW_AT_type        : <0x2a>
    <2cf>   DW_AT_data_member_location: 4
 <2><2d0>: Abbrev Number: 9 (DW_TAG_member)
    <2d1>   DW_AT_name        : _w
    <2d4>   DW_AT_decl_file   : 7
    <2d4>   DW_AT_decl_line   : 155
    <2d5>   DW_AT_decl_column : 7
    <2d6>   DW_AT_type        : <0x2a>
    <2da>   DW_AT_data_member_location: 8
 <2><2db>: Abbrev Number: 2 (DW_TAG_member)
    <2dc>   DW_AT_name        : (indirect string, offset: 0x42e23): _flags
    <2e0>   DW_AT_decl_file   : 7
    <2e1>   DW_AT_decl_line   : 156
    <2e2>   DW_AT_decl_column : 9
    <2e3>   DW_AT_type        : <0x60>
    <2e7>   DW_AT_data_member_location: 12
 <2><2e8>: Abbrev Number: 2 (DW_TAG_member)
    <2e9>   DW_AT_name        : (indirect string, offset: 0x16e74): _file
    <2ed>   DW_AT_decl_file   : 7
    <2ee>   DW_AT_decl_line   : 157
    <2ef>   DW_AT_decl_column : 9
    <2f0>   DW_AT_type        : <0x60>
    <2f4>   DW_AT_data_member_location: 14
 <2><2f5>: Abbrev Number: 9 (DW_TAG_member)
    <2f6>   DW_AT_name        : _bf
    <2fa>   DW_AT_decl_file   : 7
    <2fa>   DW_AT_decl_line   : 158
    <2fb>   DW_AT_decl_column : 17
    <2fc>   DW_AT_type        : <0x284>
    <300>   DW_AT_data_member_location: 16
 <2><301>: Abbrev Number: 2 (DW_TAG_member)
    <302>   DW_AT_name        : (indirect string, offset: 0x433ff): _lbfsize
    <306>   DW_AT_decl_file   : 7
    <307>   DW_AT_decl_line   : 159
    <308>   DW_AT_decl_column : 7
    <309>   DW_AT_type        : <0x2a>
    <30d>   DW_AT_data_member_location: 24
 <2><30e>: Abbrev Number: 2 (DW_TAG_member)
    <30f>   DW_AT_name        : (indirect string, offset: 0x9e575): _data
    <313>   DW_AT_decl_file   : 7
    <314>   DW_AT_decl_line   : 162
    <315>   DW_AT_decl_column : 18
    <316>   DW_AT_type        : <0x501>
    <31a>   DW_AT_data_member_location: 28
 <2><31b>: Abbrev Number: 2 (DW_TAG_member)
    <31c>   DW_AT_name        : (indirect string, offset: 0x82cf1): _cookie
    <320>   DW_AT_decl_file   : 7
    <321>   DW_AT_decl_line   : 166
    <322>   DW_AT_decl_column : 10
    <323>   DW_AT_type        : <0xbf>
    <327>   DW_AT_data_member_location: 32
 <2><328>: Abbrev Number: 2 (DW_TAG_member)
    <329>   DW_AT_name        : (indirect string, offset: 0x73aab): _read
    <32d>   DW_AT_decl_file   : 7
    <32e>   DW_AT_decl_line   : 168
    <32f>   DW_AT_decl_column : 29
    <330>   DW_AT_type        : <0x535>
    <334>   DW_AT_data_member_location: 36
 <2><335>: Abbrev Number: 2 (DW_TAG_member)
    <336>   DW_AT_name        : (indirect string, offset: 0x12704): _write
    <33a>   DW_AT_decl_file   : 7
    <33b>   DW_AT_decl_line   : 170
    <33c>   DW_AT_decl_column : 29
    <33d>   DW_AT_type        : <0x55d>
    <341>   DW_AT_data_member_location: 40
 <2><342>: Abbrev Number: 2 (DW_TAG_member)
    <343>   DW_AT_name        : (indirect string, offset: 0x907dd): _seek
    <347>   DW_AT_decl_file   : 7
    <348>   DW_AT_decl_line   : 173
    <349>   DW_AT_decl_column : 13
    <34a>   DW_AT_type        : <0x580>
    <34e>   DW_AT_data_member_location: 44
 <2><34f>: Abbrev Number: 2 (DW_TAG_member)
    <350>   DW_AT_name        : (indirect string, offset: 0x40218): _close
    <354>   DW_AT_decl_file   : 7
    <355>   DW_AT_decl_line   : 174
    <356>   DW_AT_decl_column : 9
    <357>   DW_AT_type        : <0x599>
    <35b>   DW_AT_data_member_location: 48
 <2><35c>: Abbrev Number: 9 (DW_TAG_member)
    <35d>   DW_AT_name        : _ub
    <361>   DW_AT_decl_file   : 7
    <361>   DW_AT_decl_line   : 177
    <362>   DW_AT_decl_column : 17
    <363>   DW_AT_type        : <0x284>
    <367>   DW_AT_data_member_location: 52
 <2><368>: Abbrev Number: 9 (DW_TAG_member)
    <369>   DW_AT_name        : _up
    <36d>   DW_AT_decl_file   : 7
    <36d>   DW_AT_decl_line   : 178
    <36e>   DW_AT_decl_column : 18
    <36f>   DW_AT_type        : <0x2aa>
    <373>   DW_AT_data_member_location: 60
 <2><374>: Abbrev Number: 9 (DW_TAG_member)
    <375>   DW_AT_name        : _ur
    <379>   DW_AT_decl_file   : 7
    <379>   DW_AT_decl_line   : 179
    <37a>   DW_AT_decl_column : 7
    <37b>   DW_AT_type        : <0x2a>
    <37f>   DW_AT_data_member_location: 64
 <2><380>: Abbrev Number: 2 (DW_TAG_member)
    <381>   DW_AT_name        : (indirect string, offset: 0x27b17): _ubuf
    <385>   DW_AT_decl_file   : 7
    <386>   DW_AT_decl_line   : 182
    <387>   DW_AT_decl_column : 17
    <388>   DW_AT_type        : <0x59e>
    <38c>   DW_AT_data_member_location: 68
 <2><38d>: Abbrev Number: 2 (DW_TAG_member)
    <38e>   DW_AT_name        : (indirect string, offset: 0x6382f): _nbuf
    <392>   DW_AT_decl_file   : 7
    <393>   DW_AT_decl_line   : 183
    <394>   DW_AT_decl_column : 17
    <395>   DW_AT_type        : <0x5ae>
    <399>   DW_AT_data_member_location: 71
 <2><39a>: Abbrev Number: 9 (DW_TAG_member)
    <39b>   DW_AT_name        : _lb
    <39f>   DW_AT_decl_file   : 7
    <39f>   DW_AT_decl_line   : 186
    <3a0>   DW_AT_decl_column : 17
    <3a1>   DW_AT_type        : <0x284>
    <3a5>   DW_AT_data_member_location: 72
 <2><3a6>: Abbrev Number: 2 (DW_TAG_member)
    <3a7>   DW_AT_name        : (indirect string, offset: 0x99702): _blksize
    <3ab>   DW_AT_decl_file   : 7
    <3ac>   DW_AT_decl_line   : 189
    <3ad>   DW_AT_decl_column : 7
    <3ae>   DW_AT_type        : <0x2a>
    <3b2>   DW_AT_data_member_location: 80
 <2><3b3>: Abbrev Number: 2 (DW_TAG_member)
    <3b4>   DW_AT_name        : (indirect string, offset: 0x2f1c5): _offset
    <3b8>   DW_AT_decl_file   : 7
    <3b9>   DW_AT_decl_line   : 190
    <3ba>   DW_AT_decl_column : 10
    <3bb>   DW_AT_type        : <0xf2>
    <3bf>   DW_AT_data_member_location: 84
 <2><3c0>: Abbrev Number: 2 (DW_TAG_member)
    <3c1>   DW_AT_name        : (indirect string, offset: 0x2d329): _lock
    <3c5>   DW_AT_decl_file   : 7
    <3c6>   DW_AT_decl_line   : 197
    <3c7>   DW_AT_decl_column : 12
    <3c8>   DW_AT_type        : <0x18c>
    <3cc>   DW_AT_data_member_location: 88
 <2><3cd>: Abbrev Number: 2 (DW_TAG_member)
    <3ce>   DW_AT_name        : (indirect string, offset: 0x10d63): _mbstate
    <3d2>   DW_AT_decl_file   : 7
    <3d3>   DW_AT_decl_line   : 199
    <3d4>   DW_AT_decl_column : 14
    <3d5>   DW_AT_type        : <0x15e>
    <3d9>   DW_AT_data_member_location: 92
 <2><3da>: Abbrev Number: 2 (DW_TAG_member)
    <3db>   DW_AT_name        : (indirect string, offset: 0x77112): _flags2
    <3df>   DW_AT_decl_file   : 7
    <3e0>   DW_AT_decl_line   : 200
    <3e1>   DW_AT_decl_column : 9
    <3e2>   DW_AT_type        : <0x2a>
    <3e6>   DW_AT_data_member_location: 100
 <2><3e7>: Abbrev Number: 0
 <1><3e8>: Abbrev Number: 10 (DW_TAG_structure_type)
    <3e9>   DW_AT_name        : (indirect string, offset: 0xa0b97): _reent
    <3ed>   DW_AT_byte_size   : 76
    <3ee>   DW_AT_decl_file   : 7
    <3ef>   DW_AT_decl_line   : 375
    <3f1>   DW_AT_decl_column : 8
    <3f2>   DW_AT_sibling     : <0x501>
 <2><3f6>: Abbrev Number: 1 (DW_TAG_member)
    <3f7>   DW_AT_name        : (indirect string, offset: 0x99e16): _errno
    <3fb>   DW_AT_decl_file   : 7
    <3fc>   DW_AT_decl_line   : 379
    <3fe>   DW_AT_decl_column : 7
    <3ff>   DW_AT_type        : <0x2a>
    <403>   DW_AT_data_member_location: 0
 <2><404>: Abbrev Number: 1 (DW_TAG_member)
    <405>   DW_AT_name        : (indirect string, offset: 0x4a8ae): _stdin
    <409>   DW_AT_decl_file   : 7
    <40a>   DW_AT_decl_line   : 384
    <40c>   DW_AT_decl_column : 11
    <40d>   DW_AT_type        : <0x5cb>
    <411>   DW_AT_data_member_location: 4
 <2><412>: Abbrev Number: 1 (DW_TAG_member)
    <413>   DW_AT_name        : (indirect string, offset: 0x64b46): _stdout
    <417>   DW_AT_decl_file   : 7
    <418>   DW_AT_decl_line   : 384
    <41a>   DW_AT_decl_column : 20
    <41b>   DW_AT_type        : <0x5cb>
    <41f>   DW_AT_data_member_location: 8
 <2><420>: Abbrev Number: 1 (DW_TAG_member)
    <421>   DW_AT_name        : (indirect string, offset: 0x85e72): _stderr
    <425>   DW_AT_decl_file   : 7
    <426>   DW_AT_decl_line   : 384
    <428>   DW_AT_decl_column : 30
    <429>   DW_AT_type        : <0x5cb>
    <42d>   DW_AT_data_member_location: 12
 <2><42e>: Abbrev Number: 1 (DW_TAG_member)
    <42f>   DW_AT_name        : (indirect string, offset: 0x5cde4): _inc
    <433>   DW_AT_decl_file   : 7
    <434>   DW_AT_decl_line   : 386
    <436>   DW_AT_decl_column : 8
    <437>   DW_AT_type        : <0x2a>
    <43b>   DW_AT_data_member_location: 16
 <2><43c>: Abbrev Number: 1 (DW_TAG_member)
    <43d>   DW_AT_name        : (indirect string, offset: 0x73cf7): _emergency
    <441>   DW_AT_decl_file   : 7
    <442>   DW_AT_decl_line   : 388
    <444>   DW_AT_decl_column : 9
    <445>   DW_AT_type        : <0x524>
    <449>   DW_AT_data_member_location: 20
 <2><44a>: Abbrev Number: 1 (DW_TAG_member)
    <44b>   DW_AT_name        : (indirect string, offset: 0x82170): _locale
    <44f>   DW_AT_decl_file   : 7
    <450>   DW_AT_decl_line   : 394
    <452>   DW_AT_decl_column : 22
    <453>   DW_AT_type        : <0x731>
    <457>   DW_AT_data_member_location: 24
 <2><458>: Abbrev Number: 25 (DW_TAG_member)
    <459>   DW_AT_name        : _mp
    <45d>   DW_AT_decl_file   : 7
    <45e>   DW_AT_decl_line   : 396
    <460>   DW_AT_decl_column : 18
    <461>   DW_AT_type        : <0x736>
    <465>   DW_AT_data_member_location: 28
 <2><466>: Abbrev Number: 1 (DW_TAG_member)
    <467>   DW_AT_name        : (indirect string, offset: 0x1754b): __cleanup
    <46b>   DW_AT_decl_file   : 7
    <46c>   DW_AT_decl_line   : 398
    <46e>   DW_AT_decl_column : 10
    <46f>   DW_AT_type        : <0x746>
    <473>   DW_AT_data_member_location: 32
 <2><474>: Abbrev Number: 1 (DW_TAG_member)
    <475>   DW_AT_name        : (indirect string, offset: 0x9e14): _gamma_signgam
    <479>   DW_AT_decl_file   : 7
    <47a>   DW_AT_decl_line   : 400
    <47c>   DW_AT_decl_column : 7
    <47d>   DW_AT_type        : <0x2a>
    <481>   DW_AT_data_member_location: 36
 <2><482>: Abbrev Number: 1 (DW_TAG_member)
    <483>   DW_AT_name        : (indirect string, offset: 0x6bab1): _cvtlen
    <487>   DW_AT_decl_file   : 7
    <488>   DW_AT_decl_line   : 403
    <48a>   DW_AT_decl_column : 7
    <48b>   DW_AT_type        : <0x2a>
    <48f>   DW_AT_data_member_location: 40
 <2><490>: Abbrev Number: 1 (DW_TAG_member)
    <491>   DW_AT_name        : (indirect string, offset: 0x43dc4): _cvtbuf
    <495>   DW_AT_decl_file   : 7
    <496>   DW_AT_decl_line   : 404
    <498>   DW_AT_decl_column : 9
    <499>   DW_AT_type        : <0x524>
    <49d>   DW_AT_data_member_location: 44
 <2><49e>: Abbrev Number: 1 (DW_TAG_member)
    <49f>   DW_AT_name        : (indirect string, offset: 0x6d9da): _r48
    <4a3>   DW_AT_decl_file   : 7
    <4a4>   DW_AT_decl_line   : 406
    <4a6>   DW_AT_decl_column : 19
    <4a7>   DW_AT_type        : <0x74b>
    <4ab>   DW_AT_data_member_location: 48
 <2><4ac>: Abbrev Number: 1 (DW_TAG_member)
    <4ad>   DW_AT_name        : (indirect string, offset: 0x79cb8): _localtime_buf
    <4b1>   DW_AT_decl_file   : 7
    <4b2>   DW_AT_decl_line   : 407
    <4b4>   DW_AT_decl_column : 16
    <4b5>   DW_AT_type        : <0x750>
    <4b9>   DW_AT_data_member_location: 52
 <2><4ba>: Abbrev Number: 1 (DW_TAG_member)
    <4bb>   DW_AT_name        : (indirect string, offset: 0x22ce2): _asctime_buf
    <4bf>   DW_AT_decl_file   : 7
    <4c0>   DW_AT_decl_line   : 408
    <4c2>   DW_AT_decl_column : 9
    <4c3>   DW_AT_type        : <0x524>
    <4c7>   DW_AT_data_member_location: 56
 <2><4c8>: Abbrev Number: 1 (DW_TAG_member)
    <4c9>   DW_AT_name        : (indirect string, offset: 0x7548): _sig_func
    <4cd>   DW_AT_decl_file   : 7
    <4ce>   DW_AT_decl_line   : 411
    <4d0>   DW_AT_decl_column : 12
    <4d1>   DW_AT_type        : <0x760>
    <4d5>   DW_AT_data_member_location: 60
 <2><4d6>: Abbrev Number: 1 (DW_TAG_member)
    <4d7>   DW_AT_name        : (indirect string, offset: 0x27896): __sf
    <4db>   DW_AT_decl_file   : 7
    <4dc>   DW_AT_decl_line   : 419
    <4de>   DW_AT_decl_column : 11
    <4df>   DW_AT_type        : <0x5cb>
    <4e3>   DW_AT_data_member_location: 64
 <2><4e4>: Abbrev Number: 1 (DW_TAG_member)
    <4e5>   DW_AT_name        : (indirect string, offset: 0x42263): _misc
    <4e9>   DW_AT_decl_file   : 7
    <4ea>   DW_AT_decl_line   : 420
    <4ec>   DW_AT_decl_column : 23
    <4ed>   DW_AT_type        : <0x76a>
    <4f1>   DW_AT_data_member_location: 68
 <2><4f2>: Abbrev Number: 1 (DW_TAG_member)
    <4f3>   DW_AT_name        : (indirect string, offset: 0x5b5cd): _signal_buf
    <4f7>   DW_AT_decl_file   : 7
    <4f8>   DW_AT_decl_line   : 421
    <4fa>   DW_AT_decl_column : 9
    <4fb>   DW_AT_type        : <0x524>
    <4ff>   DW_AT_data_member_location: 72
 <2><500>: Abbrev Number: 0
 <1><501>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <502>   DW_AT_byte_size   : 4
    <502>   DW_AT_type        : <0x3e8>
 <1><506>: Abbrev Number: 14 (DW_TAG_subroutine_type)
    <507>   DW_AT_prototyped  : 1
    <507>   DW_AT_type        : <0x2a>
    <50b>   DW_AT_sibling     : <0x524>
 <2><50f>: Abbrev Number: 5 (DW_TAG_formal_parameter)
    <510>   DW_AT_type        : <0x501>
 <2><514>: Abbrev Number: 5 (DW_TAG_formal_parameter)
    <515>   DW_AT_type        : <0xbf>
 <2><519>: Abbrev Number: 5 (DW_TAG_formal_parameter)
    <51a>   DW_AT_type        : <0x524>
 <2><51e>: Abbrev Number: 5 (DW_TAG_formal_parameter)
    <51f>   DW_AT_type        : <0x2a>
 <2><523>: Abbrev Number: 0
 <1><524>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <525>   DW_AT_byte_size   : 4
    <525>   DW_AT_type        : <0x529>
 <1><529>: Abbrev Number: 6 (DW_TAG_base_type)
    <52a>   DW_AT_byte_size   : 1
    <52b>   DW_AT_encoding    : 8	(unsigned char)
    <52c>   DW_AT_name        : (indirect string, offset: 0x2f547): char
 <1><530>: Abbrev Number: 26 (DW_TAG_const_type)
    <531>   DW_AT_type        : <0x529>
 <1><535>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <536>   DW_AT_byte_size   : 4
    <536>   DW_AT_type        : <0x506>
 <1><53a>: Abbrev Number: 14 (DW_TAG_subroutine_type)
    <53b>   DW_AT_prototyped  : 1
    <53b>   DW_AT_type        : <0x2a>
    <53f>   DW_AT_sibling     : <0x558>
 <2><543>: Abbrev Number: 5 (DW_TAG_formal_parameter)
    <544>   DW_AT_type        : <0x501>
 <2><548>: Abbrev Number: 5 (DW_TAG_formal_parameter)
    <549>   DW_AT_type        : <0xbf>
 <2><54d>: Abbrev Number: 5 (DW_TAG_formal_parameter)
    <54e>   DW_AT_type        : <0x558>
 <2><552>: Abbrev Number: 5 (DW_TAG_formal_parameter)
    <553>   DW_AT_type        : <0x2a>
 <2><557>: Abbrev Number: 0
 <1><558>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <559>   DW_AT_byte_size   : 4
    <559>   DW_AT_type        : <0x530>
 <1><55d>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <55e>   DW_AT_byte_size   : 4
    <55e>   DW_AT_type        : <0x53a>
 <1><562>: Abbrev Number: 14 (DW_TAG_subroutine_type)
    <563>   DW_AT_prototyped  : 1
    <563>   DW_AT_type        : <0xfe>
    <567>   DW_AT_sibling     : <0x580>
 <2><56b>: Abbrev Number: 5 (DW_TAG_formal_parameter)
    <56c>   DW_AT_type        : <0x501>
 <2><570>: Abbrev Number: 5 (DW_TAG_formal_parameter)
    <571>   DW_AT_type        : <0xbf>
 <2><575>: Abbrev Number: 5 (DW_TAG_formal_parameter)
    <576>   DW_AT_type        : <0xfe>
 <2><57a>: Abbrev Number: 5 (DW_TAG_formal_parameter)
    <57b>   DW_AT_type        : <0x2a>
 <2><57f>: Abbrev Number: 0
 <1><580>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <581>   DW_AT_byte_size   : 4
    <581>   DW_AT_type        : <0x562>
 <1><585>: Abbrev Number: 14 (DW_TAG_subroutine_type)
    <586>   DW_AT_prototyped  : 1
    <586>   DW_AT_type        : <0x2a>
    <58a>   DW_AT_sibling     : <0x599>
 <2><58e>: Abbrev Number: 5 (DW_TAG_formal_parameter)
    <58f>   DW_AT_type        : <0x501>
 <2><593>: Abbrev Number: 5 (DW_TAG_formal_parameter)
    <594>   DW_AT_type        : <0xbf>
 <2><598>: Abbrev Number: 0
 <1><599>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <59a>   DW_AT_byte_size   : 4
    <59a>   DW_AT_type        : <0x585>
 <1><59e>: Abbrev Number: 7 (DW_TAG_array_type)
    <59f>   DW_AT_type        : <0x59>
    <5a3>   DW_AT_sibling     : <0x5ae>
 <2><5a7>: Abbrev Number: 8 (DW_TAG_subrange_type)
    <5a8>   DW_AT_type        : <0x31>
    <5ac>   DW_AT_upper_bound : 2
 <2><5ad>: Abbrev Number: 0
 <1><5ae>: Abbrev Number: 7 (DW_TAG_array_type)
    <5af>   DW_AT_type        : <0x59>
    <5b3>   DW_AT_sibling     : <0x5be>
 <2><5b7>: Abbrev Number: 8 (DW_TAG_subrange_type)
    <5b8>   DW_AT_type        : <0x31>
    <5bc>   DW_AT_upper_bound : 0
 <2><5bd>: Abbrev Number: 0
 <1><5be>: Abbrev Number: 12 (DW_TAG_typedef)
    <5bf>   DW_AT_name        : (indirect string, offset: 0x5d265): __FILE
    <5c3>   DW_AT_decl_file   : 7
    <5c4>   DW_AT_decl_line   : 269
    <5c6>   DW_AT_decl_column : 26
    <5c7>   DW_AT_type        : <0x2af>
 <1><5cb>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <5cc>   DW_AT_byte_size   : 4
    <5cc>   DW_AT_type        : <0x5be>
 <1><5d0>: Abbrev Number: 10 (DW_TAG_structure_type)
    <5d1>   DW_AT_name        : (indirect string, offset: 0x32b70): _rand48
    <5d5>   DW_AT_byte_size   : 24
    <5d6>   DW_AT_decl_file   : 7
    <5d7>   DW_AT_decl_line   : 305
    <5d9>   DW_AT_decl_column : 8
    <5da>   DW_AT_sibling     : <0x617>
 <2><5de>: Abbrev Number: 1 (DW_TAG_member)
    <5df>   DW_AT_name        : (indirect string, offset: 0x2a5d9): _seed
    <5e3>   DW_AT_decl_file   : 7
    <5e4>   DW_AT_decl_line   : 306
    <5e6>   DW_AT_decl_column : 18
    <5e7>   DW_AT_type        : <0x617>
    <5eb>   DW_AT_data_member_location: 0
 <2><5ec>: Abbrev Number: 1 (DW_TAG_member)
    <5ed>   DW_AT_name        : (indirect string, offset: 0xbf78): _mult
    <5f1>   DW_AT_decl_file   : 7
    <5f2>   DW_AT_decl_line   : 307
    <5f4>   DW_AT_decl_column : 18
    <5f5>   DW_AT_type        : <0x617>
    <5f9>   DW_AT_data_member_location: 6
 <2><5fa>: Abbrev Number: 1 (DW_TAG_member)
    <5fb>   DW_AT_name        : (indirect string, offset: 0x4bd9b): _add
    <5ff>   DW_AT_decl_file   : 7
    <600>   DW_AT_decl_line   : 308
    <602>   DW_AT_decl_column : 18
    <603>   DW_AT_type        : <0x73>
    <607>   DW_AT_data_member_location: 12
 <2><608>: Abbrev Number: 1 (DW_TAG_member)
    <609>   DW_AT_name        : (indirect string, offset: 0x57752): _rand_next
    <60d>   DW_AT_decl_file   : 7
    <60e>   DW_AT_decl_line   : 311
    <610>   DW_AT_decl_column : 36
    <611>   DW_AT_type        : <0x94>
    <615>   DW_AT_data_member_location: 16
 <2><616>: Abbrev Number: 0
 <1><617>: Abbrev Number: 7 (DW_TAG_array_type)
    <618>   DW_AT_type        : <0x73>
    <61c>   DW_AT_sibling     : <0x627>
 <2><620>: Abbrev Number: 8 (DW_TAG_subrange_type)
    <621>   DW_AT_type        : <0x31>
    <625>   DW_AT_upper_bound : 2
 <2><626>: Abbrev Number: 0
 <1><627>: Abbrev Number: 10 (DW_TAG_structure_type)
    <628>   DW_AT_name        : (indirect string, offset: 0x6fa2b): _mprec
    <62c>   DW_AT_byte_size   : 16
    <62d>   DW_AT_decl_file   : 7
    <62e>   DW_AT_decl_line   : 347
    <630>   DW_AT_decl_column : 8
    <631>   DW_AT_sibling     : <0x66e>
 <2><635>: Abbrev Number: 1 (DW_TAG_member)
    <636>   DW_AT_name        : (indirect string, offset: 0x9293e): _result
    <63a>   DW_AT_decl_file   : 7
    <63b>   DW_AT_decl_line   : 350
    <63d>   DW_AT_decl_column : 19
    <63e>   DW_AT_type        : <0x1ee>
    <642>   DW_AT_data_member_location: 0
 <2><643>: Abbrev Number: 1 (DW_TAG_member)
    <644>   DW_AT_name        : (indirect string, offset: 0x6f594): _result_k
    <648>   DW_AT_decl_file   : 7
    <649>   DW_AT_decl_line   : 351
    <64b>   DW_AT_decl_column : 7
    <64c>   DW_AT_type        : <0x2a>
    <650>   DW_AT_data_member_location: 4
 <2><651>: Abbrev Number: 1 (DW_TAG_member)
    <652>   DW_AT_name        : (indirect string, offset: 0x46221): _p5s
    <656>   DW_AT_decl_file   : 7
    <657>   DW_AT_decl_line   : 352
    <659>   DW_AT_decl_column : 19
    <65a>   DW_AT_type        : <0x1ee>
    <65e>   DW_AT_data_member_location: 8
 <2><65f>: Abbrev Number: 1 (DW_TAG_member)
    <660>   DW_AT_name        : (indirect string, offset: 0x551c7): _freelist
    <664>   DW_AT_decl_file   : 7
    <665>   DW_AT_decl_line   : 353
    <667>   DW_AT_decl_column : 20
    <668>   DW_AT_type        : <0x66e>
    <66c>   DW_AT_data_member_location: 12
 <2><66d>: Abbrev Number: 0
 <1><66e>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <66f>   DW_AT_byte_size   : 4
    <66f>   DW_AT_type        : <0x1ee>
 <1><673>: Abbrev Number: 10 (DW_TAG_structure_type)
    <674>   DW_AT_name        : (indirect string, offset: 0x461c5): _misc_reent
    <678>   DW_AT_byte_size   : 80
    <679>   DW_AT_decl_file   : 7
    <67a>   DW_AT_decl_line   : 357
    <67c>   DW_AT_decl_column : 8
    <67d>   DW_AT_sibling     : <0x71c>
 <2><681>: Abbrev Number: 1 (DW_TAG_member)
    <682>   DW_AT_name        : (indirect string, offset: 0x86665): _strtok_last
    <686>   DW_AT_decl_file   : 7
    <687>   DW_AT_decl_line   : 360
    <689>   DW_AT_decl_column : 9
    <68a>   DW_AT_type        : <0x524>
    <68e>   DW_AT_data_member_location: 0
 <2><68f>: Abbrev Number: 1 (DW_TAG_member)
    <690>   DW_AT_name        : (indirect string, offset: 0x3fb55): _mblen_state
    <694>   DW_AT_decl_file   : 7
    <695>   DW_AT_decl_line   : 361
    <697>   DW_AT_decl_column : 14
    <698>   DW_AT_type        : <0x15e>
    <69c>   DW_AT_data_member_location: 4
 <2><69d>: Abbrev Number: 1 (DW_TAG_member)
    <69e>   DW_AT_name        : (indirect string, offset: 0x86694): _wctomb_state
    <6a2>   DW_AT_decl_file   : 7
    <6a3>   DW_AT_decl_line   : 362
    <6a5>   DW_AT_decl_column : 14
    <6a6>   DW_AT_type        : <0x15e>
    <6aa>   DW_AT_data_member_location: 12
 <2><6ab>: Abbrev Number: 1 (DW_TAG_member)
    <6ac>   DW_AT_name        : (indirect string, offset: 0x7cf31): _mbtowc_state
    <6b0>   DW_AT_decl_file   : 7
    <6b1>   DW_AT_decl_line   : 363
    <6b3>   DW_AT_decl_column : 14
    <6b4>   DW_AT_type        : <0x15e>
    <6b8>   DW_AT_data_member_location: 20
 <2><6b9>: Abbrev Number: 1 (DW_TAG_member)
    <6ba>   DW_AT_name        : (indirect string, offset: 0x4ab0e): _l64a_buf
    <6be>   DW_AT_decl_file   : 7
    <6bf>   DW_AT_decl_line   : 364
    <6c1>   DW_AT_decl_column : 8
    <6c2>   DW_AT_type        : <0x71c>
    <6c6>   DW_AT_data_member_location: 28
 <2><6c7>: Abbrev Number: 1 (DW_TAG_member)
    <6c8>   DW_AT_name        : (indirect string, offset: 0x8550d): _getdate_err
    <6cc>   DW_AT_decl_file   : 7
    <6cd>   DW_AT_decl_line   : 365
    <6cf>   DW_AT_decl_column : 7
    <6d0>   DW_AT_type        : <0x2a>
    <6d4>   DW_AT_data_member_location: 36
 <2><6d5>: Abbrev Number: 1 (DW_TAG_member)
    <6d6>   DW_AT_name        : (indirect string, offset: 0x47132): _mbrlen_state
    <6da>   DW_AT_decl_file   : 7
    <6db>   DW_AT_decl_line   : 366
    <6dd>   DW_AT_decl_column : 14
    <6de>   DW_AT_type        : <0x15e>
    <6e2>   DW_AT_data_member_location: 40
 <2><6e3>: Abbrev Number: 1 (DW_TAG_member)
    <6e4>   DW_AT_name        : (indirect string, offset: 0x20456): _mbrtowc_state
    <6e8>   DW_AT_decl_file   : 7
    <6e9>   DW_AT_decl_line   : 367
    <6eb>   DW_AT_decl_column : 14
    <6ec>   DW_AT_type        : <0x15e>
    <6f0>   DW_AT_data_member_location: 48
 <2><6f1>: Abbrev Number: 1 (DW_TAG_member)
    <6f2>   DW_AT_name        : (indirect string, offset: 0x60dd4): _mbsrtowcs_state
    <6f6>   DW_AT_decl_file   : 7
    <6f7>   DW_AT_decl_line   : 368
    <6f9>   DW_AT_decl_column : 14
    <6fa>   DW_AT_type        : <0x15e>
    <6fe>   DW_AT_data_member_location: 56
 <2><6ff>: Abbrev Number: 1 (DW_TAG_member)
    <700>   DW_AT_name        : (indirect string, offset: 0x2d02a): _wcrtomb_state
    <704>   DW_AT_decl_file   : 7
    <705>   DW_AT_decl_line   : 369
    <707>   DW_AT_decl_column : 14
    <708>   DW_AT_type        : <0x15e>
    <70c>   DW_AT_data_member_location: 64
 <2><70d>: Abbrev Number: 1 (DW_TAG_member)
    <70e>   DW_AT_name        : (indirect string, offset: 0x53c6f): _wcsrtombs_state
    <712>   DW_AT_decl_file   : 7
    <713>   DW_AT_decl_line   : 370
    <715>   DW_AT_decl_column : 14
    <716>   DW_AT_type        : <0x15e>
    <71a>   DW_AT_data_member_location: 72
 <2><71b>: Abbrev Number: 0
 <1><71c>: Abbrev Number: 7 (DW_TAG_array_type)
    <71d>   DW_AT_type        : <0x529>
    <721>   DW_AT_sibling     : <0x72c>
 <2><725>: Abbrev Number: 8 (DW_TAG_subrange_type)
    <726>   DW_AT_type        : <0x31>
    <72a>   DW_AT_upper_bound : 7
 <2><72b>: Abbrev Number: 0
 <1><72c>: Abbrev Number: 15 (DW_TAG_structure_type)
    <72d>   DW_AT_name        : (indirect string, offset: 0x7d91b): __locale_t
    <731>   DW_AT_declaration : 1
 <1><731>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <732>   DW_AT_byte_size   : 4
    <732>   DW_AT_type        : <0x72c>
 <1><736>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <737>   DW_AT_byte_size   : 4
    <737>   DW_AT_type        : <0x627>
 <1><73b>: Abbrev Number: 17 (DW_TAG_subroutine_type)
    <73c>   DW_AT_prototyped  : 1
    <73c>   DW_AT_sibling     : <0x746>
 <2><740>: Abbrev Number: 5 (DW_TAG_formal_parameter)
    <741>   DW_AT_type        : <0x501>
 <2><745>: Abbrev Number: 0
 <1><746>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <747>   DW_AT_byte_size   : 4
    <747>   DW_AT_type        : <0x73b>
 <1><74b>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <74c>   DW_AT_byte_size   : 4
    <74c>   DW_AT_type        : <0x5d0>
 <1><750>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <751>   DW_AT_byte_size   : 4
    <751>   DW_AT_type        : <0x203>
 <1><755>: Abbrev Number: 17 (DW_TAG_subroutine_type)
    <756>   DW_AT_prototyped  : 1
    <756>   DW_AT_sibling     : <0x760>
 <2><75a>: Abbrev Number: 5 (DW_TAG_formal_parameter)
    <75b>   DW_AT_type        : <0x2a>
 <2><75f>: Abbrev Number: 0
 <1><760>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <761>   DW_AT_byte_size   : 4
    <761>   DW_AT_type        : <0x765>
 <1><765>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <766>   DW_AT_byte_size   : 4
    <766>   DW_AT_type        : <0x755>
 <1><76a>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <76b>   DW_AT_byte_size   : 4
    <76b>   DW_AT_type        : <0x673>
 <1><76f>: Abbrev Number: 10 (DW_TAG_structure_type)
    <770>   DW_AT_name        : (indirect string, offset: 0x7a753): xSTATIC_LIST_ITEM
    <774>   DW_AT_byte_size   : 20
    <775>   DW_AT_decl_file   : 9
    <776>   DW_AT_decl_line   : 1061
    <778>   DW_AT_decl_column : 8
    <779>   DW_AT_sibling     : <0x79a>
 <2><77d>: Abbrev Number: 1 (DW_TAG_member)
    <77e>   DW_AT_name        : (indirect string, offset: 0x9438c): xDummy2
    <782>   DW_AT_decl_file   : 9
    <783>   DW_AT_decl_line   : 1066
    <785>   DW_AT_decl_column : 13
    <786>   DW_AT_type        : <0xd9>
    <78a>   DW_AT_data_member_location: 0
 <2><78b>: Abbrev Number: 1 (DW_TAG_member)
    <78c>   DW_AT_name        : (indirect string, offset: 0x347a8): pvDummy3
    <790>   DW_AT_decl_file   : 9
    <791>   DW_AT_decl_line   : 1067
    <793>   DW_AT_decl_column : 8
    <794>   DW_AT_type        : <0x79a>
    <798>   DW_AT_data_member_location: 4
 <2><799>: Abbrev Number: 0
 <1><79a>: Abbrev Number: 7 (DW_TAG_array_type)
    <79b>   DW_AT_type        : <0xbf>
    <79f>   DW_AT_sibling     : <0x7aa>
 <2><7a3>: Abbrev Number: 8 (DW_TAG_subrange_type)
    <7a4>   DW_AT_type        : <0x31>
    <7a8>   DW_AT_upper_bound : 3
 <2><7a9>: Abbrev Number: 0
 <1><7aa>: Abbrev Number: 12 (DW_TAG_typedef)
    <7ab>   DW_AT_name        : (indirect string, offset: 0x349f7): StaticListItem_t
    <7af>   DW_AT_decl_file   : 9
    <7b0>   DW_AT_decl_line   : 1072
    <7b2>   DW_AT_decl_column : 34
    <7b3>   DW_AT_type        : <0x76f>
 <1><7b7>: Abbrev Number: 10 (DW_TAG_structure_type)
    <7b8>   DW_AT_name        : (indirect string, offset: 0x5459b): xSTATIC_TCB
    <7bc>   DW_AT_byte_size   : 160
    <7bd>   DW_AT_decl_file   : 9
    <7be>   DW_AT_decl_line   : 1112
    <7c0>   DW_AT_decl_column : 16
    <7c1>   DW_AT_sibling     : <0x852>
 <2><7c5>: Abbrev Number: 1 (DW_TAG_member)
    <7c6>   DW_AT_name        : (indirect string, offset: 0x1e211): pxDummy1
    <7ca>   DW_AT_decl_file   : 9
    <7cb>   DW_AT_decl_line   : 1114
    <7cd>   DW_AT_decl_column : 11
    <7ce>   DW_AT_type        : <0xbf>
    <7d2>   DW_AT_data_member_location: 0
 <2><7d3>: Abbrev Number: 1 (DW_TAG_member)
    <7d4>   DW_AT_name        : (indirect string, offset: 0x1c51b): xDummy3
    <7d8>   DW_AT_decl_file   : 9
    <7d9>   DW_AT_decl_line   : 1118
    <7db>   DW_AT_decl_column : 19
    <7dc>   DW_AT_type        : <0x852>
    <7e0>   DW_AT_data_member_location: 4
 <2><7e1>: Abbrev Number: 1 (DW_TAG_member)
    <7e2>   DW_AT_name        : (indirect string, offset: 0x14985): uxDummy5
    <7e6>   DW_AT_decl_file   : 9
    <7e7>   DW_AT_decl_line   : 1119
    <7e9>   DW_AT_decl_column : 16
    <7ea>   DW_AT_type        : <0xcd>
    <7ee>   DW_AT_data_member_location: 44
 <2><7ef>: Abbrev Number: 1 (DW_TAG_member)
    <7f0>   DW_AT_name        : (indirect string, offset: 0x1e234): pxDummy6
    <7f4>   DW_AT_decl_file   : 9
    <7f5>   DW_AT_decl_line   : 1120
    <7f7>   DW_AT_decl_column : 11
    <7f8>   DW_AT_type        : <0xbf>
    <7fc>   DW_AT_data_member_location: 48
 <2><7fd>: Abbrev Number: 1 (DW_TAG_member)
    <7fe>   DW_AT_name        : (indirect string, offset: 0x33931): ucDummy7
    <802>   DW_AT_decl_file   : 9
    <803>   DW_AT_decl_line   : 1121
    <805>   DW_AT_decl_column : 13
    <806>   DW_AT_type        : <0x862>
    <80a>   DW_AT_data_member_location: 52
 <2><80b>: Abbrev Number: 1 (DW_TAG_member)
    <80c>   DW_AT_name        : (indirect string, offset: 0x84953): uxDummy12
    <810>   DW_AT_decl_file   : 9
    <811>   DW_AT_decl_line   : 1132
    <813>   DW_AT_decl_column : 16
    <814>   DW_AT_type        : <0x872>
    <818>   DW_AT_data_member_location: 68
 <2><819>: Abbrev Number: 1 (DW_TAG_member)
    <81a>   DW_AT_name        : (indirect string, offset: 0x74e2f): xDummy17
    <81e>   DW_AT_decl_file   : 9
    <81f>   DW_AT_decl_line   : 1144
    <821>   DW_AT_decl_column : 17
    <822>   DW_AT_type        : <0x3e8>
    <826>   DW_AT_data_member_location: 76
 <2><827>: Abbrev Number: 1 (DW_TAG_member)
    <828>   DW_AT_name        : (indirect string, offset: 0x15aeb): ulDummy18
    <82c>   DW_AT_decl_file   : 9
    <82d>   DW_AT_decl_line   : 1147
    <82f>   DW_AT_decl_column : 14
    <830>   DW_AT_type        : <0xb3>
    <834>   DW_AT_data_member_location: 152
 <2><835>: Abbrev Number: 1 (DW_TAG_member)
    <836>   DW_AT_name        : (indirect string, offset: 0x9091a): ucDummy19
    <83a>   DW_AT_decl_file   : 9
    <83b>   DW_AT_decl_line   : 1148
    <83d>   DW_AT_decl_column : 13
    <83e>   DW_AT_type        : <0x9b>
    <842>   DW_AT_data_member_location: 156
 <2><843>: Abbrev Number: 1 (DW_TAG_member)
    <844>   DW_AT_name        : (indirect string, offset: 0x84cd5): uxDummy20
    <848>   DW_AT_decl_file   : 9
    <849>   DW_AT_decl_line   : 1151
    <84b>   DW_AT_decl_column : 13
    <84c>   DW_AT_type        : <0x9b>
    <850>   DW_AT_data_member_location: 157
 <2><851>: Abbrev Number: 0
 <1><852>: Abbrev Number: 7 (DW_TAG_array_type)
    <853>   DW_AT_type        : <0x7aa>
    <857>   DW_AT_sibling     : <0x862>
 <2><85b>: Abbrev Number: 8 (DW_TAG_subrange_type)
    <85c>   DW_AT_type        : <0x31>
    <860>   DW_AT_upper_bound : 1
 <2><861>: Abbrev Number: 0
 <1><862>: Abbrev Number: 7 (DW_TAG_array_type)
    <863>   DW_AT_type        : <0x9b>
    <867>   DW_AT_sibling     : <0x872>
 <2><86b>: Abbrev Number: 8 (DW_TAG_subrange_type)
    <86c>   DW_AT_type        : <0x31>
    <870>   DW_AT_upper_bound : 15
 <2><871>: Abbrev Number: 0
 <1><872>: Abbrev Number: 7 (DW_TAG_array_type)
    <873>   DW_AT_type        : <0xcd>
    <877>   DW_AT_sibling     : <0x882>
 <2><87b>: Abbrev Number: 8 (DW_TAG_subrange_type)
    <87c>   DW_AT_type        : <0x31>
    <880>   DW_AT_upper_bound : 1
 <2><881>: Abbrev Number: 0
 <1><882>: Abbrev Number: 12 (DW_TAG_typedef)
    <883>   DW_AT_name        : (indirect string, offset: 0x48c40): StaticTask_t
    <887>   DW_AT_decl_file   : 9
    <888>   DW_AT_decl_line   : 1160
    <88a>   DW_AT_decl_column : 3
    <88b>   DW_AT_type        : <0x7b7>
 <1><88f>: Abbrev Number: 4 (DW_TAG_typedef)
    <890>   DW_AT_name        : (indirect string, offset: 0x7f685): TaskHandle_t
    <894>   DW_AT_decl_file   : 10
    <895>   DW_AT_decl_line   : 70
    <896>   DW_AT_decl_column : 37
    <897>   DW_AT_type        : <0x89b>
 <1><89b>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <89c>   DW_AT_byte_size   : 4
    <89c>   DW_AT_type        : <0x8a0>
 <1><8a0>: Abbrev Number: 15 (DW_TAG_structure_type)
    <8a1>   DW_AT_name        : (indirect string, offset: 0x7c800): tskTaskControlBlock
    <8a5>   DW_AT_declaration : 1
 <1><8a5>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <8a6>   DW_AT_byte_size   : 4
    <8a6>   DW_AT_type        : <0xc1>
 <1><8aa>: Abbrev Number: 18 (DW_TAG_variable)
    <8ab>   DW_AT_name        : (indirect string, offset: 0x4d933): xIdleTaskTCBBuffer
    <8af>   DW_AT_decl_file   : 1
    <8af>   DW_AT_decl_line   : 88
    <8b0>   DW_AT_decl_column : 21
    <8b1>   DW_AT_type        : <0x882>
    <8b5>   DW_AT_location    : 5 byte block: 3 88 0 0 20 	(DW_OP_addr: 20000088)
 <1><8bb>: Abbrev Number: 7 (DW_TAG_array_type)
    <8bc>   DW_AT_type        : <0xc1>
    <8c0>   DW_AT_sibling     : <0x8cb>
 <2><8c4>: Abbrev Number: 8 (DW_TAG_subrange_type)
    <8c5>   DW_AT_type        : <0x31>
    <8c9>   DW_AT_upper_bound : 127
 <2><8ca>: Abbrev Number: 0
 <1><8cb>: Abbrev Number: 18 (DW_TAG_variable)
    <8cc>   DW_AT_name        : (indirect string, offset: 0x3698b): xIdleStack
    <8d0>   DW_AT_decl_file   : 1
    <8d0>   DW_AT_decl_line   : 89
    <8d1>   DW_AT_decl_column : 20
    <8d2>   DW_AT_type        : <0x8bb>
    <8d6>   DW_AT_location    : 5 byte block: 3 28 1 0 20 	(DW_OP_addr: 20000128)
 <1><8dc>: Abbrev Number: 19 (DW_TAG_subprogram)
    <8dd>   DW_AT_external    : 1
    <8dd>   DW_AT_name        : (indirect string, offset: 0xf56a): vApplicationGetIdleTaskMemory
    <8e1>   DW_AT_decl_file   : 1
    <8e1>   DW_AT_decl_line   : 91
    <8e2>   DW_AT_decl_column : 6
    <8e3>   DW_AT_prototyped  : 1
    <8e3>   DW_AT_low_pc      : 0x8000580
    <8e7>   DW_AT_high_pc     : 0x34
    <8eb>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <8ed>   DW_AT_call_all_calls: 1
    <8ed>   DW_AT_sibling     : <0x91c>
 <2><8f1>: Abbrev Number: 11 (DW_TAG_formal_parameter)
    <8f2>   DW_AT_name        : (indirect string, offset: 0x4d931): ppxIdleTaskTCBBuffer
    <8f6>   DW_AT_decl_file   : 1
    <8f6>   DW_AT_decl_line   : 91
    <8f7>   DW_AT_decl_column : 52
    <8f8>   DW_AT_type        : <0x91c>
    <8fc>   DW_AT_location    : 2 byte block: 91 74 	(DW_OP_fbreg: -12)
 <2><8ff>: Abbrev Number: 11 (DW_TAG_formal_parameter)
    <900>   DW_AT_name        : (indirect string, offset: 0x5542a): ppxIdleTaskStackBuffer
    <904>   DW_AT_decl_file   : 1
    <904>   DW_AT_decl_line   : 91
    <905>   DW_AT_decl_column : 88
    <906>   DW_AT_type        : <0x926>
    <90a>   DW_AT_location    : 2 byte block: 91 70 	(DW_OP_fbreg: -16)
 <2><90d>: Abbrev Number: 11 (DW_TAG_formal_parameter)
    <90e>   DW_AT_name        : (indirect string, offset: 0x5a746): pulIdleTaskStackSize
    <912>   DW_AT_decl_file   : 1
    <912>   DW_AT_decl_line   : 91
    <913>   DW_AT_decl_column : 122
    <914>   DW_AT_type        : <0x92b>
    <918>   DW_AT_location    : 2 byte block: 91 6c 	(DW_OP_fbreg: -20)
 <2><91b>: Abbrev Number: 0
 <1><91c>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <91d>   DW_AT_byte_size   : 4
    <91d>   DW_AT_type        : <0x921>
 <1><921>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <922>   DW_AT_byte_size   : 4
    <922>   DW_AT_type        : <0x882>
 <1><926>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <927>   DW_AT_byte_size   : 4
    <927>   DW_AT_type        : <0x8a5>
 <1><92b>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <92c>   DW_AT_byte_size   : 4
    <92c>   DW_AT_type        : <0xb3>
 <1><930>: Abbrev Number: 27 (DW_TAG_subprogram)
    <931>   DW_AT_external    : 1
    <931>   DW_AT_name        : (indirect string, offset: 0x8acec): vApplicationMallocFailedHook
    <935>   DW_AT_decl_file   : 1
    <936>   DW_AT_decl_line   : 72
    <937>   DW_AT_decl_column : 13
    <938>   DW_AT_prototyped  : 1
    <938>   DW_AT_low_pc      : 0
    <93c>   DW_AT_high_pc     : 0xe
    <940>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <942>   DW_AT_call_all_calls: 1
 <1><942>: Abbrev Number: 19 (DW_TAG_subprogram)
    <943>   DW_AT_external    : 1
    <943>   DW_AT_name        : (indirect string, offset: 0x350a1): vApplicationStackOverflowHook
    <947>   DW_AT_decl_file   : 1
    <947>   DW_AT_decl_line   : 63
    <948>   DW_AT_decl_column : 13
    <949>   DW_AT_prototyped  : 1
    <949>   DW_AT_low_pc      : 0
    <94d>   DW_AT_high_pc     : 0x16
    <951>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <953>   DW_AT_call_all_calls: 1
    <953>   DW_AT_sibling     : <0x974>
 <2><957>: Abbrev Number: 11 (DW_TAG_formal_parameter)
    <958>   DW_AT_name        : (indirect string, offset: 0x698ec): xTask
    <95c>   DW_AT_decl_file   : 1
    <95c>   DW_AT_decl_line   : 63
    <95d>   DW_AT_decl_column : 55
    <95e>   DW_AT_type        : <0x88f>
    <962>   DW_AT_location    : 2 byte block: 91 74 	(DW_OP_fbreg: -12)
 <2><965>: Abbrev Number: 11 (DW_TAG_formal_parameter)
    <966>   DW_AT_name        : (indirect string, offset: 0x3206e): pcTaskName
    <96a>   DW_AT_decl_file   : 1
    <96a>   DW_AT_decl_line   : 63
    <96b>   DW_AT_decl_column : 75
    <96c>   DW_AT_type        : <0x974>
    <970>   DW_AT_location    : 2 byte block: 91 70 	(DW_OP_fbreg: -16)
 <2><973>: Abbrev Number: 0
 <1><974>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <975>   DW_AT_byte_size   : 4
    <975>   DW_AT_type        : <0x46>
 <1><979>: Abbrev Number: 0
  Compilation Unit @ offset 0x97a:
   Length:        0x3066 (32-bit)
   Version:       5
   Unit Type:     DW_UT_compile (1)
   Abbrev Offset: 0x188
   Pointer Size:  4
 <0><986>: Abbrev Number: 48 (DW_TAG_compile_unit)
    <987>   DW_AT_producer    : (indirect string, offset: 0x35fed): GNU C11 12.3.1 20230626 -mcpu=cortex-m4 -mfpu=fpv4-sp-d16 -mfloat-abi=hard -mthumb -march=armv7e-m+fp -g3 -O0 -std=gnu11 -ffunction-sections -fdata-sections -fstack-usage -fcyclomatic-complexity
    <98b>   DW_AT_language    : 29	(C11)
    <98c>   DW_AT_name        : (indirect string, offset: 0x9865f): ../Core/Src/main.c
    <990>   DW_AT_comp_dir    : (indirect string, offset: 0x602c5): C:/Users/yahmad/Downloads/vpersonal/bajaDAQ/can/Debug
    <994>   DW_AT_ranges      : 0x2b
    <998>   DW_AT_low_pc      : 0
    <99c>   DW_AT_stmt_list   : 0x9e4
    <9a0>   DW_AT_macros      : 0x15d2b
 <1><9a4>: Abbrev Number: 25 (DW_TAG_enumeration_type)
    <9a5>   DW_AT_encoding    : 5	(signed)
    <9a6>   DW_AT_byte_size   : 1
    <9a7>   DW_AT_type        : <0xb39>
    <9ab>   DW_AT_decl_file   : 3
    <9ac>   DW_AT_decl_line   : 66
    <9ad>   DW_AT_decl_column : 1
    <9ae>   DW_AT_sibling     : <0xb39>
 <2><9b2>: Abbrev Number: 20 (DW_TAG_enumerator)
    <9b3>   DW_AT_name        : (indirect string, offset: 0x985dd): NonMaskableInt_IRQn
    <9b7>   DW_AT_const_value : -14
 <2><9b8>: Abbrev Number: 20 (DW_TAG_enumerator)
    <9b9>   DW_AT_name        : (indirect string, offset: 0x970c3): MemoryManagement_IRQn
    <9bd>   DW_AT_const_value : -12
 <2><9be>: Abbrev Number: 20 (DW_TAG_enumerator)
    <9bf>   DW_AT_name        : (indirect string, offset: 0x97b55): BusFault_IRQn
    <9c3>   DW_AT_const_value : -11
 <2><9c4>: Abbrev Number: 20 (DW_TAG_enumerator)
    <9c5>   DW_AT_name        : (indirect string, offset: 0x98553): UsageFault_IRQn
    <9c9>   DW_AT_const_value : -10
 <2><9ca>: Abbrev Number: 20 (DW_TAG_enumerator)
    <9cb>   DW_AT_name        : (indirect string, offset: 0x9399b): SVCall_IRQn
    <9cf>   DW_AT_const_value : -5
 <2><9d0>: Abbrev Number: 20 (DW_TAG_enumerator)
    <9d1>   DW_AT_name        : (indirect string, offset: 0x962c8): DebugMonitor_IRQn
    <9d5>   DW_AT_const_value : -4
 <2><9d6>: Abbrev Number: 20 (DW_TAG_enumerator)
    <9d7>   DW_AT_name        : (indirect string, offset: 0x967db): PendSV_IRQn
    <9db>   DW_AT_const_value : -2
 <2><9dc>: Abbrev Number: 20 (DW_TAG_enumerator)
    <9dd>   DW_AT_name        : (indirect string, offset: 0x97d9f): SysTick_IRQn
    <9e1>   DW_AT_const_value : -1
 <2><9e2>: Abbrev Number: 3 (DW_TAG_enumerator)
    <9e3>   DW_AT_name        : (indirect string, offset: 0x97427): WWDG_IRQn
    <9e7>   DW_AT_const_value : 0
 <2><9e8>: Abbrev Number: 3 (DW_TAG_enumerator)
    <9e9>   DW_AT_name        : (indirect string, offset: 0x94422): PVD_IRQn
    <9ed>   DW_AT_const_value : 1
 <2><9ee>: Abbrev Number: 3 (DW_TAG_enumerator)
    <9ef>   DW_AT_name        : (indirect string, offset: 0x98d4f): TAMP_STAMP_IRQn
    <9f3>   DW_AT_const_value : 2
 <2><9f4>: Abbrev Number: 3 (DW_TAG_enumerator)
    <9f5>   DW_AT_name        : (indirect string, offset: 0x96bef): RTC_WKUP_IRQn
    <9f9>   DW_AT_const_value : 3
 <2><9fa>: Abbrev Number: 3 (DW_TAG_enumerator)
    <9fb>   DW_AT_name        : (indirect string, offset: 0x94a44): FLASH_IRQn
    <9ff>   DW_AT_const_value : 4
 <2><a00>: Abbrev Number: 3 (DW_TAG_enumerator)
    <a01>   DW_AT_name        : (indirect string, offset: 0x97b39): RCC_IRQn
    <a05>   DW_AT_const_value : 5
 <2><a06>: Abbrev Number: 3 (DW_TAG_enumerator)
    <a07>   DW_AT_name        : (indirect string, offset: 0x962da): EXTI0_IRQn
    <a0b>   DW_AT_const_value : 6
 <2><a0c>: Abbrev Number: 3 (DW_TAG_enumerator)
    <a0d>   DW_AT_name        : (indirect string, offset: 0x98dd7): EXTI1_IRQn
    <a11>   DW_AT_const_value : 7
 <2><a12>: Abbrev Number: 3 (DW_TAG_enumerator)
    <a13>   DW_AT_name        : (indirect string, offset: 0x95e52): EXTI2_IRQn
    <a17>   DW_AT_const_value : 8
 <2><a18>: Abbrev Number: 3 (DW_TAG_enumerator)
    <a19>   DW_AT_name        : (indirect string, offset: 0x97e76): EXTI3_IRQn
    <a1d>   DW_AT_const_value : 9
 <2><a1e>: Abbrev Number: 3 (DW_TAG_enumerator)
    <a1f>   DW_AT_name        : (indirect string, offset: 0x94d30): EXTI4_IRQn
    <a23>   DW_AT_const_value : 10
 <2><a24>: Abbrev Number: 3 (DW_TAG_enumerator)
    <a25>   DW_AT_name        : (indirect string, offset: 0x94265): DMA1_Stream0_IRQn
    <a29>   DW_AT_const_value : 11
 <2><a2a>: Abbrev Number: 3 (DW_TAG_enumerator)
    <a2b>   DW_AT_name        : (indirect string, offset: 0x99020): DMA1_Stream1_IRQn
    <a2f>   DW_AT_const_value : 12
 <2><a30>: Abbrev Number: 3 (DW_TAG_enumerator)
    <a31>   DW_AT_name        : (indirect string, offset: 0x95ccd): DMA1_Stream2_IRQn
    <a35>   DW_AT_const_value : 13
 <2><a36>: Abbrev Number: 3 (DW_TAG_enumerator)
    <a37>   DW_AT_name        : (indirect string, offset: 0x950bf): DMA1_Stream3_IRQn
    <a3b>   DW_AT_const_value : 14
 <2><a3c>: Abbrev Number: 3 (DW_TAG_enumerator)
    <a3d>   DW_AT_name        : (indirect string, offset: 0x9503d): DMA1_Stream4_IRQn
    <a41>   DW_AT_const_value : 15
 <2><a42>: Abbrev Number: 3 (DW_TAG_enumerator)
    <a43>   DW_AT_name        : (indirect string, offset: 0x9798f): DMA1_Stream5_IRQn
    <a47>   DW_AT_const_value : 16
 <2><a48>: Abbrev Number: 3 (DW_TAG_enumerator)
    <a49>   DW_AT_name        : (indirect string, offset: 0x946ba): DMA1_Stream6_IRQn
    <a4d>   DW_AT_const_value : 17
 <2><a4e>: Abbrev Number: 3 (DW_TAG_enumerator)
    <a4f>   DW_AT_name        : (indirect string, offset: 0x96388): ADC_IRQn
    <a53>   DW_AT_const_value : 18
 <2><a54>: Abbrev Number: 3 (DW_TAG_enumerator)
    <a55>   DW_AT_name        : (indirect string, offset: 0x93c59): EXTI9_5_IRQn
    <a59>   DW_AT_const_value : 23
 <2><a5a>: Abbrev Number: 3 (DW_TAG_enumerator)
    <a5b>   DW_AT_name        : (indirect string, offset: 0x959dd): TIM1_BRK_TIM9_IRQn
    <a5f>   DW_AT_const_value : 24
 <2><a60>: Abbrev Number: 3 (DW_TAG_enumerator)
    <a61>   DW_AT_name        : (indirect string, offset: 0x96b17): TIM1_UP_TIM10_IRQn
    <a65>   DW_AT_const_value : 25
 <2><a66>: Abbrev Number: 3 (DW_TAG_enumerator)
    <a67>   DW_AT_name        : (indirect string, offset: 0x97705): TIM1_TRG_COM_TIM11_IRQn
    <a6b>   DW_AT_const_value : 26
 <2><a6c>: Abbrev Number: 3 (DW_TAG_enumerator)
    <a6d>   DW_AT_name        : (indirect string, offset: 0x952cf): TIM1_CC_IRQn
    <a71>   DW_AT_const_value : 27
 <2><a72>: Abbrev Number: 3 (DW_TAG_enumerator)
    <a73>   DW_AT_name        : (indirect string, offset: 0x941e2): TIM2_IRQn
    <a77>   DW_AT_const_value : 28
 <2><a78>: Abbrev Number: 3 (DW_TAG_enumerator)
    <a79>   DW_AT_name        : (indirect string, offset: 0x96ab7): TIM3_IRQn
    <a7d>   DW_AT_const_value : 29
 <2><a7e>: Abbrev Number: 3 (DW_TAG_enumerator)
    <a7f>   DW_AT_name        : (indirect string, offset: 0x9538d): TIM4_IRQn
    <a83>   DW_AT_const_value : 30
 <2><a84>: Abbrev Number: 3 (DW_TAG_enumerator)
    <a85>   DW_AT_name        : (indirect string, offset: 0x953d9): I2C1_EV_IRQn
    <a89>   DW_AT_const_value : 31
 <2><a8a>: Abbrev Number: 3 (DW_TAG_enumerator)
    <a8b>   DW_AT_name        : (indirect string, offset: 0x96f51): I2C1_ER_IRQn
    <a8f>   DW_AT_const_value : 32
 <2><a90>: Abbrev Number: 3 (DW_TAG_enumerator)
    <a91>   DW_AT_name        : (indirect string, offset: 0x941c2): I2C2_EV_IRQn
    <a95>   DW_AT_const_value : 33
 <2><a96>: Abbrev Number: 3 (DW_TAG_enumerator)
    <a97>   DW_AT_name        : (indirect string, offset: 0x95879): I2C2_ER_IRQn
    <a9b>   DW_AT_const_value : 34
 <2><a9c>: Abbrev Number: 3 (DW_TAG_enumerator)
    <a9d>   DW_AT_name        : (indirect string, offset: 0x941cf): SPI1_IRQn
    <aa1>   DW_AT_const_value : 35
 <2><aa2>: Abbrev Number: 3 (DW_TAG_enumerator)
    <aa3>   DW_AT_name        : (indirect string, offset: 0x96a39): SPI2_IRQn
    <aa7>   DW_AT_const_value : 36
 <2><aa8>: Abbrev Number: 3 (DW_TAG_enumerator)
    <aa9>   DW_AT_name        : (indirect string, offset: 0x97bc6): USART1_IRQn
    <aad>   DW_AT_const_value : 37
 <2><aae>: Abbrev Number: 3 (DW_TAG_enumerator)
    <aaf>   DW_AT_name        : (indirect string, offset: 0x94b4b): USART2_IRQn
    <ab3>   DW_AT_const_value : 38
 <2><ab4>: Abbrev Number: 3 (DW_TAG_enumerator)
    <ab5>   DW_AT_name        : (indirect string, offset: 0x3e52b): EXTI15_10_IRQn
    <ab9>   DW_AT_const_value : 40
 <2><aba>: Abbrev Number: 3 (DW_TAG_enumerator)
    <abb>   DW_AT_name        : (indirect string, offset: 0x981c5): RTC_Alarm_IRQn
    <abf>   DW_AT_const_value : 41
 <2><ac0>: Abbrev Number: 3 (DW_TAG_enumerator)
    <ac1>   DW_AT_name        : (indirect string, offset: 0x94a33): OTG_FS_WKUP_IRQn
    <ac5>   DW_AT_const_value : 42
 <2><ac6>: Abbrev Number: 3 (DW_TAG_enumerator)
    <ac7>   DW_AT_name        : (indirect string, offset: 0x96d96): DMA1_Stream7_IRQn
    <acb>   DW_AT_const_value : 47
 <2><acc>: Abbrev Number: 3 (DW_TAG_enumerator)
    <acd>   DW_AT_name        : (indirect string, offset: 0x31cd4): SDIO_IRQn
    <ad1>   DW_AT_const_value : 49
 <2><ad2>: Abbrev Number: 3 (DW_TAG_enumerator)
    <ad3>   DW_AT_name        : (indirect string, offset: 0x95ce9): TIM5_IRQn
    <ad7>   DW_AT_const_value : 50
 <2><ad8>: Abbrev Number: 3 (DW_TAG_enumerator)
    <ad9>   DW_AT_name        : (indirect string, offset: 0x9903c): SPI3_IRQn
    <add>   DW_AT_const_value : 51
 <2><ade>: Abbrev Number: 3 (DW_TAG_enumerator)
    <adf>   DW_AT_name        : (indirect string, offset: 0x972f9): DMA2_Stream0_IRQn
    <ae3>   DW_AT_const_value : 56
 <2><ae4>: Abbrev Number: 3 (DW_TAG_enumerator)
    <ae5>   DW_AT_name        : (indirect string, offset: 0x94233): DMA2_Stream1_IRQn
    <ae9>   DW_AT_const_value : 57
 <2><aea>: Abbrev Number: 3 (DW_TAG_enumerator)
    <aeb>   DW_AT_name        : (indirect string, offset: 0x96582): DMA2_Stream2_IRQn
    <aef>   DW_AT_const_value : 58
 <2><af0>: Abbrev Number: 3 (DW_TAG_enumerator)
    <af1>   DW_AT_name        : (indirect string, offset: 0x99046): DMA2_Stream3_IRQn
    <af5>   DW_AT_const_value : 59
 <2><af6>: Abbrev Number: 3 (DW_TAG_enumerator)
    <af7>   DW_AT_name        : (indirect string, offset: 0x95d23): DMA2_Stream4_IRQn
    <afb>   DW_AT_const_value : 60
 <2><afc>: Abbrev Number: 3 (DW_TAG_enumerator)
    <afd>   DW_AT_name        : (indirect string, offset: 0x96ac1): OTG_FS_IRQn
    <b01>   DW_AT_const_value : 67
 <2><b02>: Abbrev Number: 3 (DW_TAG_enumerator)
    <b03>   DW_AT_name        : (indirect string, offset: 0x981d4): DMA2_Stream5_IRQn
    <b07>   DW_AT_const_value : 68
 <2><b08>: Abbrev Number: 3 (DW_TAG_enumerator)
    <b09>   DW_AT_name        : (indirect string, offset: 0x9509d): DMA2_Stream6_IRQn
    <b0d>   DW_AT_const_value : 69
 <2><b0e>: Abbrev Number: 3 (DW_TAG_enumerator)
    <b0f>   DW_AT_name        : (indirect string, offset: 0x979c6): DMA2_Stream7_IRQn
    <b13>   DW_AT_const_value : 70
 <2><b14>: Abbrev Number: 3 (DW_TAG_enumerator)
    <b15>   DW_AT_name        : (indirect string, offset: 0x958e7): USART6_IRQn
    <b19>   DW_AT_const_value : 71
 <2><b1a>: Abbrev Number: 3 (DW_TAG_enumerator)
    <b1b>   DW_AT_name        : (indirect string, offset: 0x98672): I2C3_EV_IRQn
    <b1f>   DW_AT_const_value : 72
 <2><b20>: Abbrev Number: 3 (DW_TAG_enumerator)
    <b21>   DW_AT_name        : (indirect string, offset: 0x944d6): I2C3_ER_IRQn
    <b25>   DW_AT_const_value : 73
 <2><b26>: Abbrev Number: 3 (DW_TAG_enumerator)
    <b27>   DW_AT_name        : (indirect string, offset: 0x93fb5): FPU_IRQn
    <b2b>   DW_AT_const_value : 81
 <2><b2c>: Abbrev Number: 3 (DW_TAG_enumerator)
    <b2d>   DW_AT_name        : (indirect string, offset: 0x95cdf): SPI4_IRQn
    <b31>   DW_AT_const_value : 84
 <2><b32>: Abbrev Number: 3 (DW_TAG_enumerator)
    <b33>   DW_AT_name        : (indirect string, offset: 0x9853c): SPI5_IRQn
    <b37>   DW_AT_const_value : 85
 <2><b38>: Abbrev Number: 0
 <1><b39>: Abbrev Number: 18 (DW_TAG_base_type)
    <b3a>   DW_AT_byte_size   : 1
    <b3b>   DW_AT_encoding    : 6	(signed char)
    <b3c>   DW_AT_name        : (indirect string, offset: 0x49c4c): signed char
 <1><b40>: Abbrev Number: 6 (DW_TAG_typedef)
    <b41>   DW_AT_name        : (indirect string, offset: 0x983c2): IRQn_Type
    <b45>   DW_AT_decl_file   : 3
    <b46>   DW_AT_decl_line   : 134
    <b47>   DW_AT_decl_column : 3
    <b48>   DW_AT_type        : <0x9a4>
 <1><b4c>: Abbrev Number: 6 (DW_TAG_typedef)
    <b4d>   DW_AT_name        : (indirect string, offset: 0x2a433): __uint8_t
    <b51>   DW_AT_decl_file   : 4
    <b52>   DW_AT_decl_line   : 43
    <b53>   DW_AT_decl_column : 24
    <b54>   DW_AT_type        : <0xb58>
 <1><b58>: Abbrev Number: 18 (DW_TAG_base_type)
    <b59>   DW_AT_byte_size   : 1
    <b5a>   DW_AT_encoding    : 8	(unsigned char)
    <b5b>   DW_AT_name        : (indirect string, offset: 0x1e203): unsigned char
 <1><b5f>: Abbrev Number: 18 (DW_TAG_base_type)
    <b60>   DW_AT_byte_size   : 2
    <b61>   DW_AT_encoding    : 5	(signed)
    <b62>   DW_AT_name        : (indirect string, offset: 0x6d523): short int
 <1><b66>: Abbrev Number: 6 (DW_TAG_typedef)
    <b67>   DW_AT_name        : (indirect string, offset: 0x778ee): __uint16_t
    <b6b>   DW_AT_decl_file   : 4
    <b6c>   DW_AT_decl_line   : 57
    <b6d>   DW_AT_decl_column : 25
    <b6e>   DW_AT_type        : <0xb72>
 <1><b72>: Abbrev Number: 18 (DW_TAG_base_type)
    <b73>   DW_AT_byte_size   : 2
    <b74>   DW_AT_encoding    : 7	(unsigned)
    <b75>   DW_AT_name        : (indirect string, offset: 0x8cdd1): short unsigned int
 <1><b79>: Abbrev Number: 18 (DW_TAG_base_type)
    <b7a>   DW_AT_byte_size   : 4
    <b7b>   DW_AT_encoding    : 5	(signed)
    <b7c>   DW_AT_name        : (indirect string, offset: 0xc13b): long int
 <1><b80>: Abbrev Number: 6 (DW_TAG_typedef)
    <b81>   DW_AT_name        : (indirect string, offset: 0x5d4be): __uint32_t
    <b85>   DW_AT_decl_file   : 4
    <b86>   DW_AT_decl_line   : 79
    <b87>   DW_AT_decl_column : 25
    <b88>   DW_AT_type        : <0xb8c>
 <1><b8c>: Abbrev Number: 18 (DW_TAG_base_type)
    <b8d>   DW_AT_byte_size   : 4
    <b8e>   DW_AT_encoding    : 7	(unsigned)
    <b8f>   DW_AT_name        : (indirect string, offset: 0x2d0f6): long unsigned int
 <1><b93>: Abbrev Number: 18 (DW_TAG_base_type)
    <b94>   DW_AT_byte_size   : 8
    <b95>   DW_AT_encoding    : 5	(signed)
    <b96>   DW_AT_name        : (indirect string, offset: 0x42d90): long long int
 <1><b9a>: Abbrev Number: 18 (DW_TAG_base_type)
    <b9b>   DW_AT_byte_size   : 8
    <b9c>   DW_AT_encoding    : 7	(unsigned)
    <b9d>   DW_AT_name        : (indirect string, offset: 0x1eb13): long long unsigned int
 <1><ba1>: Abbrev Number: 49 (DW_TAG_base_type)
    <ba2>   DW_AT_byte_size   : 4
    <ba3>   DW_AT_encoding    : 5	(signed)
    <ba4>   DW_AT_name        : int
 <1><ba8>: Abbrev Number: 18 (DW_TAG_base_type)
    <ba9>   DW_AT_byte_size   : 4
    <baa>   DW_AT_encoding    : 7	(unsigned)
    <bab>   DW_AT_name        : (indirect string, offset: 0xbbd7): unsigned int
 <1><baf>: Abbrev Number: 6 (DW_TAG_typedef)
    <bb0>   DW_AT_name        : (indirect string, offset: 0x2a435): uint8_t
    <bb4>   DW_AT_decl_file   : 5
    <bb5>   DW_AT_decl_line   : 24
    <bb6>   DW_AT_decl_column : 19
    <bb7>   DW_AT_type        : <0xb4c>
 <1><bbb>: Abbrev Number: 21 (DW_TAG_const_type)
    <bbc>   DW_AT_type        : <0xbaf>
 <1><bc0>: Abbrev Number: 6 (DW_TAG_typedef)
    <bc1>   DW_AT_name        : (indirect string, offset: 0x6acfb): uint16_t
    <bc5>   DW_AT_decl_file   : 5
    <bc6>   DW_AT_decl_line   : 36
    <bc7>   DW_AT_decl_column : 20
    <bc8>   DW_AT_type        : <0xb66>
 <1><bcc>: Abbrev Number: 17 (DW_TAG_volatile_type)
    <bcd>   DW_AT_type        : <0xbc0>
 <1><bd1>: Abbrev Number: 6 (DW_TAG_typedef)
    <bd2>   DW_AT_name        : (indirect string, offset: 0x6a5b8): uint32_t
    <bd6>   DW_AT_decl_file   : 5
    <bd7>   DW_AT_decl_line   : 48
    <bd8>   DW_AT_decl_column : 20
    <bd9>   DW_AT_type        : <0xb80>
 <1><bdd>: Abbrev Number: 17 (DW_TAG_volatile_type)
    <bde>   DW_AT_type        : <0xbd1>
 <1><be2>: Abbrev Number: 21 (DW_TAG_const_type)
    <be3>   DW_AT_type        : <0xbd1>
 <1><be7>: Abbrev Number: 9 (DW_TAG_array_type)
    <be8>   DW_AT_type        : <0xbd1>
    <bec>   DW_AT_sibling     : <0xbf7>
 <2><bf0>: Abbrev Number: 11 (DW_TAG_subrange_type)
    <bf1>   DW_AT_type        : <0xba8>
    <bf5>   DW_AT_upper_bound : 0
 <2><bf6>: Abbrev Number: 0
 <1><bf7>: Abbrev Number: 9 (DW_TAG_array_type)
    <bf8>   DW_AT_type        : <0xbd1>
    <bfc>   DW_AT_sibling     : <0xc07>
 <2><c00>: Abbrev Number: 11 (DW_TAG_subrange_type)
    <c01>   DW_AT_type        : <0xba8>
    <c05>   DW_AT_upper_bound : 1
 <2><c06>: Abbrev Number: 0
 <1><c07>: Abbrev Number: 16 (DW_TAG_structure_type)
    <c08>   DW_AT_byte_size   : 24
    <c09>   DW_AT_decl_file   : 3
    <c0a>   DW_AT_decl_line   : 214
    <c0b>   DW_AT_decl_column : 9
    <c0b>   DW_AT_sibling     : <0xc5d>
 <2><c0f>: Abbrev Number: 14 (DW_TAG_member)
    <c10>   DW_AT_name        : CR
    <c13>   DW_AT_decl_file   : 3
    <c14>   DW_AT_decl_line   : 216
    <c15>   DW_AT_decl_column : 17
    <c16>   DW_AT_type        : <0xbdd>
    <c1a>   DW_AT_data_member_location: 0
 <2><c1b>: Abbrev Number: 1 (DW_TAG_member)
    <c1c>   DW_AT_name        : (indirect string, offset: 0x96255): NDTR
    <c20>   DW_AT_decl_file   : 3
    <c21>   DW_AT_decl_line   : 217
    <c22>   DW_AT_decl_column : 17
    <c23>   DW_AT_type        : <0xbdd>
    <c27>   DW_AT_data_member_location: 4
 <2><c28>: Abbrev Number: 14 (DW_TAG_member)
    <c29>   DW_AT_name        : PAR
    <c2d>   DW_AT_decl_file   : 3
    <c2e>   DW_AT_decl_line   : 218
    <c2f>   DW_AT_decl_column : 17
    <c30>   DW_AT_type        : <0xbdd>
    <c34>   DW_AT_data_member_location: 8
 <2><c35>: Abbrev Number: 1 (DW_TAG_member)
    <c36>   DW_AT_name        : (indirect string, offset: 0x95b9a): M0AR
    <c3a>   DW_AT_decl_file   : 3
    <c3b>   DW_AT_decl_line   : 219
    <c3c>   DW_AT_decl_column : 17
    <c3d>   DW_AT_type        : <0xbdd>
    <c41>   DW_AT_data_member_location: 12
 <2><c42>: Abbrev Number: 1 (DW_TAG_member)
    <c43>   DW_AT_name        : (indirect string, offset: 0x940c1): M1AR
    <c47>   DW_AT_decl_file   : 3
    <c48>   DW_AT_decl_line   : 220
    <c49>   DW_AT_decl_column : 17
    <c4a>   DW_AT_type        : <0xbdd>
    <c4e>   DW_AT_data_member_location: 16
 <2><c4f>: Abbrev Number: 14 (DW_TAG_member)
    <c50>   DW_AT_name        : FCR
    <c54>   DW_AT_decl_file   : 3
    <c55>   DW_AT_decl_line   : 221
    <c56>   DW_AT_decl_column : 17
    <c57>   DW_AT_type        : <0xbdd>
    <c5b>   DW_AT_data_member_location: 20
 <2><c5c>: Abbrev Number: 0
 <1><c5d>: Abbrev Number: 6 (DW_TAG_typedef)
    <c5e>   DW_AT_name        : (indirect string, offset: 0x9886b): DMA_Stream_TypeDef
    <c62>   DW_AT_decl_file   : 3
    <c63>   DW_AT_decl_line   : 222
    <c64>   DW_AT_decl_column : 3
    <c65>   DW_AT_type        : <0xc07>
 <1><c69>: Abbrev Number: 27 (DW_TAG_structure_type)
    <c6a>   DW_AT_byte_size   : 40
    <c6b>   DW_AT_decl_file   : 3
    <c6c>   DW_AT_decl_line   : 265
    <c6e>   DW_AT_decl_column : 9
    <c6e>   DW_AT_sibling     : <0xcf1>
 <2><c72>: Abbrev Number: 2 (DW_TAG_member)
    <c73>   DW_AT_name        : (indirect string, offset: 0x93952): MODER
    <c77>   DW_AT_decl_file   : 3
    <c78>   DW_AT_decl_line   : 267
    <c7a>   DW_AT_decl_column : 17
    <c7b>   DW_AT_type        : <0xbdd>
    <c7f>   DW_AT_data_member_location: 0
 <2><c80>: Abbrev Number: 2 (DW_TAG_member)
    <c81>   DW_AT_name        : (indirect string, offset: 0x97b77): OTYPER
    <c85>   DW_AT_decl_file   : 3
    <c86>   DW_AT_decl_line   : 268
    <c88>   DW_AT_decl_column : 17
    <c89>   DW_AT_type        : <0xbdd>
    <c8d>   DW_AT_data_member_location: 4
 <2><c8e>: Abbrev Number: 2 (DW_TAG_member)
    <c8f>   DW_AT_name        : (indirect string, offset: 0x983aa): OSPEEDR
    <c93>   DW_AT_decl_file   : 3
    <c94>   DW_AT_decl_line   : 269
    <c96>   DW_AT_decl_column : 17
    <c97>   DW_AT_type        : <0xbdd>
    <c9b>   DW_AT_data_member_location: 8
 <2><c9c>: Abbrev Number: 2 (DW_TAG_member)
    <c9d>   DW_AT_name        : (indirect string, offset: 0x94626): PUPDR
    <ca1>   DW_AT_decl_file   : 3
    <ca2>   DW_AT_decl_line   : 270
    <ca4>   DW_AT_decl_column : 17
    <ca5>   DW_AT_type        : <0xbdd>
    <ca9>   DW_AT_data_member_location: 12
 <2><caa>: Abbrev Number: 8 (DW_TAG_member)
    <cab>   DW_AT_name        : IDR
    <caf>   DW_AT_decl_file   : 3
    <cb0>   DW_AT_decl_line   : 271
    <cb2>   DW_AT_decl_column : 17
    <cb3>   DW_AT_type        : <0xbdd>
    <cb7>   DW_AT_data_member_location: 16
 <2><cb8>: Abbrev Number: 8 (DW_TAG_member)
    <cb9>   DW_AT_name        : ODR
    <cbd>   DW_AT_decl_file   : 3
    <cbe>   DW_AT_decl_line   : 272
    <cc0>   DW_AT_decl_column : 17
    <cc1>   DW_AT_type        : <0xbdd>
    <cc5>   DW_AT_data_member_location: 20
 <2><cc6>: Abbrev Number: 2 (DW_TAG_member)
    <cc7>   DW_AT_name        : (indirect string, offset: 0x94add): BSRR
    <ccb>   DW_AT_decl_file   : 3
    <ccc>   DW_AT_decl_line   : 273
    <cce>   DW_AT_decl_column : 17
    <ccf>   DW_AT_type        : <0xbdd>
    <cd3>   DW_AT_data_member_location: 24
 <2><cd4>: Abbrev Number: 2 (DW_TAG_member)
    <cd5>   DW_AT_name        : (indirect string, offset: 0x98325): LCKR
    <cd9>   DW_AT_decl_file   : 3
    <cda>   DW_AT_decl_line   : 274
    <cdc>   DW_AT_decl_column : 17
    <cdd>   DW_AT_type        : <0xbdd>
    <ce1>   DW_AT_data_member_location: 28
 <2><ce2>: Abbrev Number: 8 (DW_TAG_member)
    <ce3>   DW_AT_name        : AFR
    <ce7>   DW_AT_decl_file   : 3
    <ce8>   DW_AT_decl_line   : 275
    <cea>   DW_AT_decl_column : 17
    <ceb>   DW_AT_type        : <0xd01>
    <cef>   DW_AT_data_member_location: 32
 <2><cf0>: Abbrev Number: 0
 <1><cf1>: Abbrev Number: 9 (DW_TAG_array_type)
    <cf2>   DW_AT_type        : <0xbdd>
    <cf6>   DW_AT_sibling     : <0xd01>
 <2><cfa>: Abbrev Number: 11 (DW_TAG_subrange_type)
    <cfb>   DW_AT_type        : <0xba8>
    <cff>   DW_AT_upper_bound : 1
 <2><d00>: Abbrev Number: 0
 <1><d01>: Abbrev Number: 17 (DW_TAG_volatile_type)
    <d02>   DW_AT_type        : <0xcf1>
 <1><d06>: Abbrev Number: 12 (DW_TAG_typedef)
    <d07>   DW_AT_name        : (indirect string, offset: 0x98f36): GPIO_TypeDef
    <d0b>   DW_AT_decl_file   : 3
    <d0c>   DW_AT_decl_line   : 276
    <d0e>   DW_AT_decl_column : 3
    <d0f>   DW_AT_type        : <0xc69>
 <1><d13>: Abbrev Number: 27 (DW_TAG_structure_type)
    <d14>   DW_AT_byte_size   : 8
    <d15>   DW_AT_decl_file   : 3
    <d16>   DW_AT_decl_line   : 326
    <d18>   DW_AT_decl_column : 9
    <d18>   DW_AT_sibling     : <0xd38>
 <2><d1c>: Abbrev Number: 8 (DW_TAG_member)
    <d1d>   DW_AT_name        : CR
    <d20>   DW_AT_decl_file   : 3
    <d21>   DW_AT_decl_line   : 328
    <d23>   DW_AT_decl_column : 17
    <d24>   DW_AT_type        : <0xbdd>
    <d28>   DW_AT_data_member_location: 0
 <2><d29>: Abbrev Number: 8 (DW_TAG_member)
    <d2a>   DW_AT_name        : CSR
    <d2e>   DW_AT_decl_file   : 3
    <d2f>   DW_AT_decl_line   : 329
    <d31>   DW_AT_decl_column : 17
    <d32>   DW_AT_type        : <0xbdd>
    <d36>   DW_AT_data_member_location: 4
 <2><d37>: Abbrev Number: 0
 <1><d38>: Abbrev Number: 12 (DW_TAG_typedef)
    <d39>   DW_AT_name        : (indirect string, offset: 0x9789d): PWR_TypeDef
    <d3d>   DW_AT_decl_file   : 3
    <d3e>   DW_AT_decl_line   : 330
    <d40>   DW_AT_decl_column : 3
    <d41>   DW_AT_type        : <0xd13>
 <1><d45>: Abbrev Number: 27 (DW_TAG_structure_type)
    <d46>   DW_AT_byte_size   : 144
    <d47>   DW_AT_decl_file   : 3
    <d48>   DW_AT_decl_line   : 336
    <d4a>   DW_AT_decl_column : 9
    <d4a>   DW_AT_sibling     : <0xf0e>
 <2><d4e>: Abbrev Number: 8 (DW_TAG_member)
    <d4f>   DW_AT_name        : CR
    <d52>   DW_AT_decl_file   : 3
    <d53>   DW_AT_decl_line   : 338
    <d55>   DW_AT_decl_column : 17
    <d56>   DW_AT_type        : <0xbdd>
    <d5a>   DW_AT_data_member_location: 0
 <2><d5b>: Abbrev Number: 2 (DW_TAG_member)
    <d5c>   DW_AT_name        : (indirect string, offset: 0x9775e): PLLCFGR
    <d60>   DW_AT_decl_file   : 3
    <d61>   DW_AT_decl_line   : 339
    <d63>   DW_AT_decl_column : 17
    <d64>   DW_AT_type        : <0xbdd>
    <d68>   DW_AT_data_member_location: 4
 <2><d69>: Abbrev Number: 2 (DW_TAG_member)
    <d6a>   DW_AT_name        : (indirect string, offset: 0x95d86): CFGR
    <d6e>   DW_AT_decl_file   : 3
    <d6f>   DW_AT_decl_line   : 340
    <d71>   DW_AT_decl_column : 17
    <d72>   DW_AT_type        : <0xbdd>
    <d76>   DW_AT_data_member_location: 8
 <2><d77>: Abbrev Number: 8 (DW_TAG_member)
    <d78>   DW_AT_name        : CIR
    <d7c>   DW_AT_decl_file   : 3
    <d7d>   DW_AT_decl_line   : 341
    <d7f>   DW_AT_decl_column : 17
    <d80>   DW_AT_type        : <0xbdd>
    <d84>   DW_AT_data_member_location: 12
 <2><d85>: Abbrev Number: 2 (DW_TAG_member)
    <d86>   DW_AT_name        : (indirect string, offset: 0x97d84): AHB1RSTR
    <d8a>   DW_AT_decl_file   : 3
    <d8b>   DW_AT_decl_line   : 342
    <d8d>   DW_AT_decl_column : 17
    <d8e>   DW_AT_type        : <0xbdd>
    <d92>   DW_AT_data_member_location: 16
 <2><d93>: Abbrev Number: 2 (DW_TAG_member)
    <d94>   DW_AT_name        : (indirect string, offset: 0x94215): AHB2RSTR
    <d98>   DW_AT_decl_file   : 3
    <d99>   DW_AT_decl_line   : 343
    <d9b>   DW_AT_decl_column : 17
    <d9c>   DW_AT_type        : <0xbdd>
    <da0>   DW_AT_data_member_location: 20
 <2><da1>: Abbrev Number: 2 (DW_TAG_member)
    <da2>   DW_AT_name        : (indirect string, offset: 0x95d7a): AHB3RSTR
    <da6>   DW_AT_decl_file   : 3
    <da7>   DW_AT_decl_line   : 344
    <da9>   DW_AT_decl_column : 17
    <daa>   DW_AT_type        : <0xbdd>
    <dae>   DW_AT_data_member_location: 24
 <2><daf>: Abbrev Number: 2 (DW_TAG_member)
    <db0>   DW_AT_name        : (indirect string, offset: 0x98cff): RESERVED0
    <db4>   DW_AT_decl_file   : 3
    <db5>   DW_AT_decl_line   : 345
    <db7>   DW_AT_decl_column : 17
    <db8>   DW_AT_type        : <0xbd1>
    <dbc>   DW_AT_data_member_location: 28
 <2><dbd>: Abbrev Number: 2 (DW_TAG_member)
    <dbe>   DW_AT_name        : (indirect string, offset: 0x941d9): APB1RSTR
    <dc2>   DW_AT_decl_file   : 3
    <dc3>   DW_AT_decl_line   : 346
    <dc5>   DW_AT_decl_column : 17
    <dc6>   DW_AT_type        : <0xbdd>
    <dca>   DW_AT_data_member_location: 32
 <2><dcb>: Abbrev Number: 2 (DW_TAG_member)
    <dcc>   DW_AT_name        : (indirect string, offset: 0x95d65): APB2RSTR
    <dd0>   DW_AT_decl_file   : 3
    <dd1>   DW_AT_decl_line   : 347
    <dd3>   DW_AT_decl_column : 17
    <dd4>   DW_AT_type        : <0xbdd>
    <dd8>   DW_AT_data_member_location: 36
 <2><dd9>: Abbrev Number: 2 (DW_TAG_member)
    <dda>   DW_AT_name        : (indirect string, offset: 0x98d09): RESERVED1
    <dde>   DW_AT_decl_file   : 3
    <ddf>   DW_AT_decl_line   : 348
    <de1>   DW_AT_decl_column : 17
    <de2>   DW_AT_type        : <0xbf7>
    <de6>   DW_AT_data_member_location: 40
 <2><de7>: Abbrev Number: 2 (DW_TAG_member)
    <de8>   DW_AT_name        : (indirect string, offset: 0x93fc8): AHB1ENR
    <dec>   DW_AT_decl_file   : 3
    <ded>   DW_AT_decl_line   : 349
    <def>   DW_AT_decl_column : 17
    <df0>   DW_AT_type        : <0xbdd>
    <df4>   DW_AT_data_member_location: 48
 <2><df5>: Abbrev Number: 2 (DW_TAG_member)
    <df6>   DW_AT_name        : (indirect string, offset: 0x94db1): AHB2ENR
    <dfa>   DW_AT_decl_file   : 3
    <dfb>   DW_AT_decl_line   : 350
    <dfd>   DW_AT_decl_column : 17
    <dfe>   DW_AT_type        : <0xbdd>
    <e02>   DW_AT_data_member_location: 52
 <2><e03>: Abbrev Number: 2 (DW_TAG_member)
    <e04>   DW_AT_name        : (indirect string, offset: 0x95e5d): AHB3ENR
    <e08>   DW_AT_decl_file   : 3
    <e09>   DW_AT_decl_line   : 351
    <e0b>   DW_AT_decl_column : 17
    <e0c>   DW_AT_type        : <0xbdd>
    <e10>   DW_AT_data_member_location: 56
 <2><e11>: Abbrev Number: 2 (DW_TAG_member)
    <e12>   DW_AT_name        : (indirect string, offset: 0x98d13): RESERVED2
    <e16>   DW_AT_decl_file   : 3
    <e17>   DW_AT_decl_line   : 352
    <e19>   DW_AT_decl_column : 17
    <e1a>   DW_AT_type        : <0xbd1>
    <e1e>   DW_AT_data_member_location: 60
 <2><e1f>: Abbrev Number: 2 (DW_TAG_member)
    <e20>   DW_AT_name        : (indirect string, offset: 0x979fb): APB1ENR
    <e24>   DW_AT_decl_file   : 3
    <e25>   DW_AT_decl_line   : 353
    <e27>   DW_AT_decl_column : 17
    <e28>   DW_AT_type        : <0xbdd>
    <e2c>   DW_AT_data_member_location: 64
 <2><e2d>: Abbrev Number: 2 (DW_TAG_member)
    <e2e>   DW_AT_name        : (indirect string, offset: 0x9425d): APB2ENR
    <e32>   DW_AT_decl_file   : 3
    <e33>   DW_AT_decl_line   : 354
    <e35>   DW_AT_decl_column : 17
    <e36>   DW_AT_type        : <0xbdd>
    <e3a>   DW_AT_data_member_location: 68
 <2><e3b>: Abbrev Number: 2 (DW_TAG_member)
    <e3c>   DW_AT_name        : (indirect string, offset: 0x98d1d): RESERVED3
    <e40>   DW_AT_decl_file   : 3
    <e41>   DW_AT_decl_line   : 355
    <e43>   DW_AT_decl_column : 17
    <e44>   DW_AT_type        : <0xbf7>
    <e48>   DW_AT_data_member_location: 72
 <2><e49>: Abbrev Number: 2 (DW_TAG_member)
    <e4a>   DW_AT_name        : (indirect string, offset: 0x96358): AHB1LPENR
    <e4e>   DW_AT_decl_file   : 3
    <e4f>   DW_AT_decl_line   : 356
    <e51>   DW_AT_decl_column : 17
    <e52>   DW_AT_type        : <0xbdd>
    <e56>   DW_AT_data_member_location: 80
 <2><e57>: Abbrev Number: 2 (DW_TAG_member)
    <e58>   DW_AT_name        : (indirect string, offset: 0x94ab9): AHB2LPENR
    <e5c>   DW_AT_decl_file   : 3
    <e5d>   DW_AT_decl_line   : 357
    <e5f>   DW_AT_decl_column : 17
    <e60>   DW_AT_type        : <0xbdd>
    <e64>   DW_AT_data_member_location: 84
 <2><e65>: Abbrev Number: 2 (DW_TAG_member)
    <e66>   DW_AT_name        : (indirect string, offset: 0x9740a): AHB3LPENR
    <e6a>   DW_AT_decl_file   : 3
    <e6b>   DW_AT_decl_line   : 358
    <e6d>   DW_AT_decl_column : 17
    <e6e>   DW_AT_type        : <0xbdd>
    <e72>   DW_AT_data_member_location: 88
 <2><e73>: Abbrev Number: 2 (DW_TAG_member)
    <e74>   DW_AT_name        : (indirect string, offset: 0x98d27): RESERVED4
    <e78>   DW_AT_decl_file   : 3
    <e79>   DW_AT_decl_line   : 359
    <e7b>   DW_AT_decl_column : 17
    <e7c>   DW_AT_type        : <0xbd1>
    <e80>   DW_AT_data_member_location: 92
 <2><e81>: Abbrev Number: 2 (DW_TAG_member)
    <e82>   DW_AT_name        : (indirect string, offset: 0x9735e): APB1LPENR
    <e86>   DW_AT_decl_file   : 3
    <e87>   DW_AT_decl_line   : 360
    <e89>   DW_AT_decl_column : 17
    <e8a>   DW_AT_type        : <0xbdd>
    <e8e>   DW_AT_data_member_location: 96
 <2><e8f>: Abbrev Number: 2 (DW_TAG_member)
    <e90>   DW_AT_name        : (indirect string, offset: 0x93f8b): APB2LPENR
    <e94>   DW_AT_decl_file   : 3
    <e95>   DW_AT_decl_line   : 361
    <e97>   DW_AT_decl_column : 17
    <e98>   DW_AT_type        : <0xbdd>
    <e9c>   DW_AT_data_member_location: 100
 <2><e9d>: Abbrev Number: 2 (DW_TAG_member)
    <e9e>   DW_AT_name        : (indirect string, offset: 0x98d31): RESERVED5
    <ea2>   DW_AT_decl_file   : 3
    <ea3>   DW_AT_decl_line   : 362
    <ea5>   DW_AT_decl_column : 17
    <ea6>   DW_AT_type        : <0xbf7>
    <eaa>   DW_AT_data_member_location: 104
 <2><eab>: Abbrev Number: 2 (DW_TAG_member)
    <eac>   DW_AT_name        : (indirect string, offset: 0x9439d): BDCR
    <eb0>   DW_AT_decl_file   : 3
    <eb1>   DW_AT_decl_line   : 363
    <eb3>   DW_AT_decl_column : 17
    <eb4>   DW_AT_type        : <0xbdd>
    <eb8>   DW_AT_data_member_location: 112
 <2><eb9>: Abbrev Number: 8 (DW_TAG_member)
    <eba>   DW_AT_name        : CSR
    <ebe>   DW_AT_decl_file   : 3
    <ebf>   DW_AT_decl_line   : 364
    <ec1>   DW_AT_decl_column : 17
    <ec2>   DW_AT_type        : <0xbdd>
    <ec6>   DW_AT_data_member_location: 116
 <2><ec7>: Abbrev Number: 2 (DW_TAG_member)
    <ec8>   DW_AT_name        : (indirect string, offset: 0x98d3b): RESERVED6
    <ecc>   DW_AT_decl_file   : 3
    <ecd>   DW_AT_decl_line   : 365
    <ecf>   DW_AT_decl_column : 17
    <ed0>   DW_AT_type        : <0xbf7>
    <ed4>   DW_AT_data_member_location: 120
 <2><ed5>: Abbrev Number: 2 (DW_TAG_member)
    <ed6>   DW_AT_name        : (indirect string, offset: 0x965a8): SSCGR
    <eda>   DW_AT_decl_file   : 3
    <edb>   DW_AT_decl_line   : 366
    <edd>   DW_AT_decl_column : 17
    <ede>   DW_AT_type        : <0xbdd>
    <ee2>   DW_AT_data_member_location: 128
 <2><ee3>: Abbrev Number: 2 (DW_TAG_member)
    <ee4>   DW_AT_name        : (indirect string, offset: 0x95397): PLLI2SCFGR
    <ee8>   DW_AT_decl_file   : 3
    <ee9>   DW_AT_decl_line   : 367
    <eeb>   DW_AT_decl_column : 17
    <eec>   DW_AT_type        : <0xbdd>
    <ef0>   DW_AT_data_member_location: 132
 <2><ef1>: Abbrev Number: 2 (DW_TAG_member)
    <ef2>   DW_AT_name        : (indirect string, offset: 0x98d45): RESERVED7
    <ef6>   DW_AT_decl_file   : 3
    <ef7>   DW_AT_decl_line   : 368
    <ef9>   DW_AT_decl_column : 17
    <efa>   DW_AT_type        : <0xbe7>
    <efe>   DW_AT_data_member_location: 136
 <2><eff>: Abbrev Number: 2 (DW_TAG_member)
    <f00>   DW_AT_name        : (indirect string, offset: 0x95d83): DCKCFGR
    <f04>   DW_AT_decl_file   : 3
    <f05>   DW_AT_decl_line   : 369
    <f07>   DW_AT_decl_column : 17
    <f08>   DW_AT_type        : <0xbdd>
    <f0c>   DW_AT_data_member_location: 140
 <2><f0d>: Abbrev Number: 0
 <1><f0e>: Abbrev Number: 12 (DW_TAG_typedef)
    <f0f>   DW_AT_name        : (indirect string, offset: 0x95fe1): RCC_TypeDef
    <f13>   DW_AT_decl_file   : 3
    <f14>   DW_AT_decl_line   : 370
    <f16>   DW_AT_decl_column : 3
    <f17>   DW_AT_type        : <0xd45>
 <1><f1b>: Abbrev Number: 27 (DW_TAG_structure_type)
    <f1c>   DW_AT_byte_size   : 160
    <f1d>   DW_AT_decl_file   : 3
    <f1e>   DW_AT_decl_line   : 376
    <f20>   DW_AT_decl_column : 9
    <f20>   DW_AT_sibling     : <0x1152>
 <2><f24>: Abbrev Number: 8 (DW_TAG_member)
    <f25>   DW_AT_name        : TR
    <f28>   DW_AT_decl_file   : 3
    <f29>   DW_AT_decl_line   : 378
    <f2b>   DW_AT_decl_column : 17
    <f2c>   DW_AT_type        : <0xbdd>
    <f30>   DW_AT_data_member_location: 0
 <2><f31>: Abbrev Number: 8 (DW_TAG_member)
    <f32>   DW_AT_name        : DR
    <f35>   DW_AT_decl_file   : 3
    <f36>   DW_AT_decl_line   : 379
    <f38>   DW_AT_decl_column : 17
    <f39>   DW_AT_type        : <0xbdd>
    <f3d>   DW_AT_data_member_location: 4
 <2><f3e>: Abbrev Number: 8 (DW_TAG_member)
    <f3f>   DW_AT_name        : CR
    <f42>   DW_AT_decl_file   : 3
    <f43>   DW_AT_decl_line   : 380
    <f45>   DW_AT_decl_column : 17
    <f46>   DW_AT_type        : <0xbdd>
    <f4a>   DW_AT_data_member_location: 8
 <2><f4b>: Abbrev Number: 8 (DW_TAG_member)
    <f4c>   DW_AT_name        : ISR
    <f50>   DW_AT_decl_file   : 3
    <f51>   DW_AT_decl_line   : 381
    <f53>   DW_AT_decl_column : 17
    <f54>   DW_AT_type        : <0xbdd>
    <f58>   DW_AT_data_member_location: 12
 <2><f59>: Abbrev Number: 2 (DW_TAG_member)
    <f5a>   DW_AT_name        : (indirect string, offset: 0x94d91): PRER
    <f5e>   DW_AT_decl_file   : 3
    <f5f>   DW_AT_decl_line   : 382
    <f61>   DW_AT_decl_column : 17
    <f62>   DW_AT_type        : <0xbdd>
    <f66>   DW_AT_data_member_location: 16
 <2><f67>: Abbrev Number: 2 (DW_TAG_member)
    <f68>   DW_AT_name        : (indirect string, offset: 0x95597): WUTR
    <f6c>   DW_AT_decl_file   : 3
    <f6d>   DW_AT_decl_line   : 383
    <f6f>   DW_AT_decl_column : 17
    <f70>   DW_AT_type        : <0xbdd>
    <f74>   DW_AT_data_member_location: 20
 <2><f75>: Abbrev Number: 2 (DW_TAG_member)
    <f76>   DW_AT_name        : (indirect string, offset: 0x93f84): CALIBR
    <f7a>   DW_AT_decl_file   : 3
    <f7b>   DW_AT_decl_line   : 384
    <f7d>   DW_AT_decl_column : 17
    <f7e>   DW_AT_type        : <0xbdd>
    <f82>   DW_AT_data_member_location: 24
 <2><f83>: Abbrev Number: 2 (DW_TAG_member)
    <f84>   DW_AT_name        : (indirect string, offset: 0x9584f): ALRMAR
    <f88>   DW_AT_decl_file   : 3
    <f89>   DW_AT_decl_line   : 385
    <f8b>   DW_AT_decl_column : 17
    <f8c>   DW_AT_type        : <0xbdd>
    <f90>   DW_AT_data_member_location: 28
 <2><f91>: Abbrev Number: 2 (DW_TAG_member)
    <f92>   DW_AT_name        : (indirect string, offset: 0x95867): ALRMBR
    <f96>   DW_AT_decl_file   : 3
    <f97>   DW_AT_decl_line   : 386
    <f99>   DW_AT_decl_column : 17
    <f9a>   DW_AT_type        : <0xbdd>
    <f9e>   DW_AT_data_member_location: 32
 <2><f9f>: Abbrev Number: 8 (DW_TAG_member)
    <fa0>   DW_AT_name        : WPR
    <fa4>   DW_AT_decl_file   : 3
    <fa5>   DW_AT_decl_line   : 387
    <fa7>   DW_AT_decl_column : 17
    <fa8>   DW_AT_type        : <0xbdd>
    <fac>   DW_AT_data_member_location: 36
 <2><fad>: Abbrev Number: 8 (DW_TAG_member)
    <fae>   DW_AT_name        : SSR
    <fb2>   DW_AT_decl_file   : 3
    <fb3>   DW_AT_decl_line   : 388
    <fb5>   DW_AT_decl_column : 17
    <fb6>   DW_AT_type        : <0xbdd>
    <fba>   DW_AT_data_member_location: 40
 <2><fbb>: Abbrev Number: 2 (DW_TAG_member)
    <fbc>   DW_AT_name        : (indirect string, offset: 0x95b93): SHIFTR
    <fc0>   DW_AT_decl_file   : 3
    <fc1>   DW_AT_decl_line   : 389
    <fc3>   DW_AT_decl_column : 17
    <fc4>   DW_AT_type        : <0xbdd>
    <fc8>   DW_AT_data_member_location: 44
 <2><fc9>: Abbrev Number: 2 (DW_TAG_member)
    <fca>   DW_AT_name        : (indirect string, offset: 0x9679c): TSTR
    <fce>   DW_AT_decl_file   : 3
    <fcf>   DW_AT_decl_line   : 390
    <fd1>   DW_AT_decl_column : 17
    <fd2>   DW_AT_type        : <0xbdd>
    <fd6>   DW_AT_data_member_location: 48
 <2><fd7>: Abbrev Number: 2 (DW_TAG_member)
    <fd8>   DW_AT_name        : (indirect string, offset: 0x963e4): TSDR
    <fdc>   DW_AT_decl_file   : 3
    <fdd>   DW_AT_decl_line   : 391
    <fdf>   DW_AT_decl_column : 17
    <fe0>   DW_AT_type        : <0xbdd>
    <fe4>   DW_AT_data_member_location: 52
 <2><fe5>: Abbrev Number: 2 (DW_TAG_member)
    <fe6>   DW_AT_name        : (indirect string, offset: 0x93f3c): TSSSR
    <fea>   DW_AT_decl_file   : 3
    <feb>   DW_AT_decl_line   : 392
    <fed>   DW_AT_decl_column : 17
    <fee>   DW_AT_type        : <0xbdd>
    <ff2>   DW_AT_data_member_location: 56
 <2><ff3>: Abbrev Number: 2 (DW_TAG_member)
    <ff4>   DW_AT_name        : (indirect string, offset: 0x98b08): CALR
    <ff8>   DW_AT_decl_file   : 3
    <ff9>   DW_AT_decl_line   : 393
    <ffb>   DW_AT_decl_column : 17
    <ffc>   DW_AT_type        : <0xbdd>
    <1000>   DW_AT_data_member_location: 60
 <2><1001>: Abbrev Number: 2 (DW_TAG_member)
    <1002>   DW_AT_name        : (indirect string, offset: 0x98d78): TAFCR
    <1006>   DW_AT_decl_file   : 3
    <1007>   DW_AT_decl_line   : 394
    <1009>   DW_AT_decl_column : 17
    <100a>   DW_AT_type        : <0xbdd>
    <100e>   DW_AT_data_member_location: 64
 <2><100f>: Abbrev Number: 2 (DW_TAG_member)
    <1010>   DW_AT_name        : (indirect string, offset: 0x950d1): ALRMASSR
    <1014>   DW_AT_decl_file   : 3
    <1015>   DW_AT_decl_line   : 395
    <1017>   DW_AT_decl_column : 17
    <1018>   DW_AT_type        : <0xbdd>
    <101c>   DW_AT_data_member_location: 68
 <2><101d>: Abbrev Number: 2 (DW_TAG_member)
    <101e>   DW_AT_name        : (indirect string, offset: 0x961f4): ALRMBSSR
    <1022>   DW_AT_decl_file   : 3
    <1023>   DW_AT_decl_line   : 396
    <1025>   DW_AT_decl_column : 17
    <1026>   DW_AT_type        : <0xbdd>
    <102a>   DW_AT_data_member_location: 72
 <2><102b>: Abbrev Number: 2 (DW_TAG_member)
    <102c>   DW_AT_name        : (indirect string, offset: 0x98d45): RESERVED7
    <1030>   DW_AT_decl_file   : 3
    <1031>   DW_AT_decl_line   : 397
    <1033>   DW_AT_decl_column : 12
    <1034>   DW_AT_type        : <0xbd1>
    <1038>   DW_AT_data_member_location: 76
 <2><1039>: Abbrev Number: 2 (DW_TAG_member)
    <103a>   DW_AT_name        : (indirect string, offset: 0x954ea): BKP0R
    <103e>   DW_AT_decl_file   : 3
    <103f>   DW_AT_decl_line   : 398
    <1041>   DW_AT_decl_column : 17
    <1042>   DW_AT_type        : <0xbdd>
    <1046>   DW_AT_data_member_location: 80
 <2><1047>: Abbrev Number: 2 (DW_TAG_member)
    <1048>   DW_AT_name        : (indirect string, offset: 0x98b02): BKP1R
    <104c>   DW_AT_decl_file   : 3
    <104d>   DW_AT_decl_line   : 399
    <104f>   DW_AT_decl_column : 17
    <1050>   DW_AT_type        : <0xbdd>
    <1054>   DW_AT_data_member_location: 84
 <2><1055>: Abbrev Number: 2 (DW_TAG_member)
    <1056>   DW_AT_name        : (indirect string, offset: 0x954f9): BKP2R
    <105a>   DW_AT_decl_file   : 3
    <105b>   DW_AT_decl_line   : 400
    <105d>   DW_AT_decl_column : 17
    <105e>   DW_AT_type        : <0xbdd>
    <1062>   DW_AT_data_member_location: 88
 <2><1063>: Abbrev Number: 2 (DW_TAG_member)
    <1064>   DW_AT_name        : (indirect string, offset: 0x9550c): BKP3R
    <1068>   DW_AT_decl_file   : 3
    <1069>   DW_AT_decl_line   : 401
    <106b>   DW_AT_decl_column : 17
    <106c>   DW_AT_type        : <0xbdd>
    <1070>   DW_AT_data_member_location: 92
 <2><1071>: Abbrev Number: 2 (DW_TAG_member)
    <1072>   DW_AT_name        : (indirect string, offset: 0x98cf9): BKP4R
    <1076>   DW_AT_decl_file   : 3
    <1077>   DW_AT_decl_line   : 402
    <1079>   DW_AT_decl_column : 17
    <107a>   DW_AT_type        : <0xbdd>
    <107e>   DW_AT_data_member_location: 96
 <2><107f>: Abbrev Number: 2 (DW_TAG_member)
    <1080>   DW_AT_name        : (indirect string, offset: 0x98d72): BKP5R
    <1084>   DW_AT_decl_file   : 3
    <1085>   DW_AT_decl_line   : 403
    <1087>   DW_AT_decl_column : 17
    <1088>   DW_AT_type        : <0xbdd>
    <108c>   DW_AT_data_member_location: 100
 <2><108d>: Abbrev Number: 2 (DW_TAG_member)
    <108e>   DW_AT_name        : (indirect string, offset: 0x98de2): BKP6R
    <1092>   DW_AT_decl_file   : 3
    <1093>   DW_AT_decl_line   : 404
    <1095>   DW_AT_decl_column : 17
    <1096>   DW_AT_type        : <0xbdd>
    <109a>   DW_AT_data_member_location: 104
 <2><109b>: Abbrev Number: 2 (DW_TAG_member)
    <109c>   DW_AT_name        : (indirect string, offset: 0x95591): BKP7R
    <10a0>   DW_AT_decl_file   : 3
    <10a1>   DW_AT_decl_line   : 405
    <10a3>   DW_AT_decl_column : 17
    <10a4>   DW_AT_type        : <0xbdd>
    <10a8>   DW_AT_data_member_location: 108
 <2><10a9>: Abbrev Number: 2 (DW_TAG_member)
    <10aa>   DW_AT_name        : (indirect string, offset: 0x98e89): BKP8R
    <10ae>   DW_AT_decl_file   : 3
    <10af>   DW_AT_decl_line   : 406
    <10b1>   DW_AT_decl_column : 17
    <10b2>   DW_AT_type        : <0xbdd>
    <10b6>   DW_AT_data_member_location: 112
 <2><10b7>: Abbrev Number: 2 (DW_TAG_member)
    <10b8>   DW_AT_name        : (indirect string, offset: 0x9564d): BKP9R
    <10bc>   DW_AT_decl_file   : 3
    <10bd>   DW_AT_decl_line   : 407
    <10bf>   DW_AT_decl_column : 17
    <10c0>   DW_AT_type        : <0xbdd>
    <10c4>   DW_AT_data_member_location: 116
 <2><10c5>: Abbrev Number: 2 (DW_TAG_member)
    <10c6>   DW_AT_name        : (indirect string, offset: 0x95b82): BKP10R
    <10ca>   DW_AT_decl_file   : 3
    <10cb>   DW_AT_decl_line   : 408
    <10cd>   DW_AT_decl_column : 17
    <10ce>   DW_AT_type        : <0xbdd>
    <10d2>   DW_AT_data_member_location: 120
 <2><10d3>: Abbrev Number: 2 (DW_TAG_member)
    <10d4>   DW_AT_name        : (indirect string, offset: 0x94bcd): BKP11R
    <10d8>   DW_AT_decl_file   : 3
    <10d9>   DW_AT_decl_line   : 409
    <10db>   DW_AT_decl_column : 17
    <10dc>   DW_AT_type        : <0xbdd>
    <10e0>   DW_AT_data_member_location: 124
 <2><10e1>: Abbrev Number: 2 (DW_TAG_member)
    <10e2>   DW_AT_name        : (indirect string, offset: 0x93ac3): BKP12R
    <10e6>   DW_AT_decl_file   : 3
    <10e7>   DW_AT_decl_line   : 410
    <10e9>   DW_AT_decl_column : 17
    <10ea>   DW_AT_type        : <0xbdd>
    <10ee>   DW_AT_data_member_location: 128
 <2><10ef>: Abbrev Number: 2 (DW_TAG_member)
    <10f0>   DW_AT_name        : (indirect string, offset: 0x97076): BKP13R
    <10f4>   DW_AT_decl_file   : 3
    <10f5>   DW_AT_decl_line   : 411
    <10f7>   DW_AT_decl_column : 17
    <10f8>   DW_AT_type        : <0xbdd>
    <10fc>   DW_AT_data_member_location: 132
 <2><10fd>: Abbrev Number: 2 (DW_TAG_member)
    <10fe>   DW_AT_name        : (indirect string, offset: 0x981b2): BKP14R
    <1102>   DW_AT_decl_file   : 3
    <1103>   DW_AT_decl_line   : 412
    <1105>   DW_AT_decl_column : 17
    <1106>   DW_AT_type        : <0xbdd>
    <110a>   DW_AT_data_member_location: 136
 <2><110b>: Abbrev Number: 2 (DW_TAG_member)
    <110c>   DW_AT_name        : (indirect string, offset: 0x98202): BKP15R
    <1110>   DW_AT_decl_file   : 3
    <1111>   DW_AT_decl_line   : 413
    <1113>   DW_AT_decl_column : 17
    <1114>   DW_AT_type        : <0xbdd>
    <1118>   DW_AT_data_member_location: 140
 <2><1119>: Abbrev Number: 2 (DW_TAG_member)
    <111a>   DW_AT_name        : (indirect string, offset: 0x94c58): BKP16R
    <111e>   DW_AT_decl_file   : 3
    <111f>   DW_AT_decl_line   : 414
